{
  "project": "Blunderdark",
  "branchName": "ralph/hallway-pathfinding",
  "description": "Hallway Pathfinding - A* pathfinding on the dungeon grid to calculate shortest valid paths between rooms for hallway placement, avoiding occupied tiles with Manhattan distance heuristic.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement A* pathfinding algorithm",
      "description": "As a developer, I want an A* pathfinding function on the tile grid so that hallway paths can be calculated between any two points.",
      "acceptanceCriteria": [
        "A function findPath(grid, startTile, endTile): Tile[] | null exists in src/app/helpers/pathfinding.ts",
        "Uses A* algorithm with Manhattan distance heuristic",
        "Uses a priority queue (min-heap) for the open set for performance",
        "Returns the shortest path as an ordered array of tiles, or null if no valid path exists",
        "Tiles marked as occupied (by rooms or hallways) are treated as impassable",
        "Early termination when the destination is reached",
        "Unit tests verify correct paths on simple grids and obstacle avoidance",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement room-to-room path calculation",
      "description": "As a developer, I want to calculate a path from one room's edge to another room's edge so that hallways connect rooms at their boundaries.",
      "acceptanceCriteria": [
        "A function findRoomToRoomPath(roomA, roomB, grid): Tile[] | null exists",
        "Path starts from the nearest edge tile of Room A facing Room B",
        "Path ends at the nearest edge tile of Room B facing Room A",
        "Path does not include tiles inside either room",
        "Multiple start/end candidates evaluated to find the overall shortest path",
        "Paths can include 90-degree turns; algorithm prefers fewer turns when lengths are equal",
        "Unit tests verify paths with 0, 1, 2, and 3+ turns",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Write comprehensive pathfinding unit tests",
      "description": "As a developer, I want comprehensive tests for pathfinding including edge cases and performance so that the algorithm is reliable.",
      "acceptanceCriteria": [
        "Test: straight-line path with no obstacles",
        "Test: L-shaped path around a single obstacle",
        "Test: multi-turn path around complex obstacles",
        "Test: no valid path exists returns null",
        "Test: path avoids room and hallway occupied tiles",
        "Test: pathfinding on larger grid completes within acceptable time",
        "Tests in src/app/helpers/pathfinding.spec.ts",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    }
  ]
}
