{
  "project": "Blunderdark",
  "branchName": "ralph/altar-room",
  "description": "Altar Room - Starting 3x3 room auto-placed at game start, permanent fixture enabling room placement, recruitment, with 3-level upgrades and fear reduction.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Altar Room YAML gamedata",
      "description": "As a developer, I want the Altar defined in YAML gamedata with all required fields.",
      "acceptanceCriteria": [
        "An altar.yaml file exists in the appropriate gamedata/ directory",
        "Fields include: id, name, description, shape (3x3), removable (false), upgradeLevels, fearReduction",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added to gamedata/room/base.yml with all fields. Uses existing 3x3 Square shape."
    },
    {
      "id": "US-002",
      "title": "Auto-place Altar Room on new game start",
      "description": "As a new player, I want the Altar Room automatically placed when I start a new game so that I have a starting point.",
      "acceptanceCriteria": [
        "When a new game is created, the Altar Room is placed at a predefined central position",
        "The Altar occupies a 3x3 square of tiles",
        "The grid state includes the Altar as an occupied region",
        "The Altar has a unique visual distinguishing it from other rooms",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "autoPlaceRooms() in altar-room.ts places all autoPlace rooms at grid center during worldgen."
    },
    {
      "id": "US-003",
      "title": "Prevent Altar Room removal",
      "description": "As a dungeon builder, I should not be able to remove the Altar Room so that the game's anchor point is preserved.",
      "acceptanceCriteria": [
        "The Altar Room has a removable: false flag",
        "The remove/demolish action is not available for the Altar",
        "If removal is attempted programmatically, it is rejected",
        "The UI does not show a delete button for the Altar",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "removable: false on RoomDefinition. isRoomRemovable() check in removeRoom() rejects removal."
    },
    {
      "id": "US-004",
      "title": "Enable room placement via Altar",
      "description": "As a dungeon builder, I want the Altar to enable me to build new rooms so that I can expand my dungeon.",
      "acceptanceCriteria": [
        "The Build Room action is available when the Altar exists",
        "The Altar's presence is checked as a prerequisite for building",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "hasAltarRoom signal gates room placement. panel-room-select filters autoPlace rooms and checks Altar presence."
    },
    {
      "id": "US-005",
      "title": "Enable recruitment via Altar",
      "description": "As a dungeon builder, I want the Altar to enable inhabitant recruitment so that I can staff my rooms.",
      "acceptanceCriteria": [
        "Recruitment UI is accessible via the Altar",
        "Without the Altar at Level 1, basic recruitment is available",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "canRecruit computed signal based on Altar presence. panel-altar component shows recruitment status."
    },
    {
      "id": "US-006",
      "title": "Implement Altar Level 2 upgrade",
      "description": "As a dungeon builder, I want to upgrade the Altar to Level 2 for enhanced capabilities.",
      "acceptanceCriteria": [
        "Level 2 upgrade has a defined resource cost",
        "Level 2 unlocks additional features (expanded build range, faster recruitment, new room types)",
        "The Altar's visual changes to reflect Level 2",
        "Upgrade is applied immediately",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Sequential upgrade system: Level 2 costs 150g/75c/30e. applyAltarUpgrade validates ordering."
    },
    {
      "id": "US-007",
      "title": "Implement Altar Level 3 upgrade",
      "description": "As a dungeon builder, I want to upgrade the Altar to Level 3 for maximum capabilities.",
      "acceptanceCriteria": [
        "Level 3 upgrade requires Level 2 and has a higher resource cost",
        "Level 3 unlocks end-game features (advanced rooms, special abilities)",
        "The Altar's visual changes to reflect Level 3",
        "Upgrade is applied immediately",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Level 3 costs 300g/150c/60e. Requires Level 2. Level 3 supersedes Level 2 upgrade effects."
    },
    {
      "id": "US-008",
      "title": "Implement fear reduction aura",
      "description": "As the system, I want the Altar to reduce fear in adjacent rooms so that it acts as a stabilizing influence.",
      "acceptanceCriteria": [
        "Adjacent rooms receive a fear reduction modifier (e.g., -1 fear level)",
        "The reduction is applied via the fear propagation system",
        "Fear reduction may increase with Altar level",
        "Removing an adjacent room's connection to the Altar removes the reduction",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "getEffectiveFearLevel reduces fear for adjacent rooms. Aura scales with Altar level (1/2/3)."
    }
  ]
}
