{
  "project": "Blunderdark",
  "branchName": "ralph/research-ui",
  "description": "Research UI providing a visual tech-tree interface to browse, select, and initiate research across three branches (Dark, Arcane, Engineering)",
  "userStories": [
    {
      "id": "US-001",
      "title": "Research Page Shell",
      "description": "As a player, I want a dedicated Research page accessible from the game UI so that I can manage my research",
      "acceptanceCriteria": [
        "A Research page/component exists at src/app/pages/game-research/",
        "The page is accessible via a route /game/research with appropriate guards",
        "The page has a header displaying Research and navigation back to the main game",
        "The component is standalone with OnPush change detection",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "GameResearchComponent created at src/app/pages/game-research/ with route at /game/research. Header has Back button and Research title. Standalone with OnPush."
    },
    {
      "id": "US-002",
      "title": "Branch Tab Navigation",
      "description": "As a player, I want tabs to switch between the three research branches so that I can focus on one branch at a time",
      "acceptanceCriteria": [
        "Three tabs are displayed: Dark, Arcane, Engineering",
        "Clicking a tab switches the displayed research tree to that branch",
        "The active tab is visually highlighted",
        "Default tab is the first branch with available research",
        "Uses Angular Signals for the selected branch state",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "DaisyUI tabs-bordered with signal<ResearchBranch> for state. tab-active class highlights selected. Default is 'dark'."
    },
    {
      "id": "US-003",
      "title": "Research Node Rendering",
      "description": "As a player, I want to see research nodes displayed as a visual tree graph so that I understand the research structure",
      "acceptanceCriteria": [
        "Each research node is rendered as a card/box with name and icon",
        "Nodes are positioned in a tree layout with root at top and children below",
        "Lines/connectors are drawn between parent and child nodes",
        "Nodes are arranged by tier (depth in the tree)",
        "The tree is scrollable if it exceeds the viewport",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Nodes rendered as cards grouped by tier with connector lines between tiers. Tree panel is overflow-auto for scrollability."
    },
    {
      "id": "US-004",
      "title": "Node State Visualization",
      "description": "As a player, I want nodes to be visually distinct based on their state so that I can quickly identify what is available",
      "acceptanceCriteria": [
        "Completed nodes have a distinct style with green border and checkmark icon",
        "Available nodes (prerequisites met) have a highlighted/glowing style",
        "Locked nodes (prerequisites not met) are dimmed/grayed out",
        "The active research node has a pulsing or animated border",
        "Node state is derived from the research state signal using computed()",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Four node states with distinct styles: completed (green border + checkmark), active (pulsing blue border animation), available (yellow glow), locked (dimmed 40% opacity). All derived via computed()."
    },
    {
      "id": "US-005",
      "title": "Node Detail Panel",
      "description": "As a player, I want to click a node and see its details so that I can make informed research decisions",
      "acceptanceCriteria": [
        "Clicking a node opens a detail panel showing name, description, cost, prerequisites, and unlock effects",
        "If the node is available, a Start Research button is displayed",
        "If the node is locked, the panel explains which prerequisites are missing",
        "If the node is completed, the panel shows Completed with unlock effects active",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Right-side detail panel (w-72) shows on node click. Displays name, description, tier/branch badges, cost, prerequisites (with missing names for locked nodes), and state-appropriate actions."
    },
    {
      "id": "US-006",
      "title": "Start Research Action",
      "description": "As a player, I want to click Start Research on an available node so that research begins",
      "acceptanceCriteria": [
        "Clicking Start Research deducts the required resources",
        "The node transitions to in-progress state with a progress bar",
        "If resources are insufficient, the button is disabled with a tooltip explaining why",
        "If another research is already active, the button is disabled with a message",
        "The action updates the research state signal",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Start Research button calls researchStart(). Disabled with tooltip when canStart is false. Insufficient resources shown as error text. Uses existing research-progress.ts helper."
    },
    {
      "id": "US-007",
      "title": "Active Research Progress Bar",
      "description": "As a player, I want to see a progress bar for my current active research so that I know how long until it completes",
      "acceptanceCriteria": [
        "A progress bar is displayed on the active research node",
        "The progress bar shows percentage complete and estimated time remaining",
        "A summary bar at the top of the Research page shows current research name and progress",
        "Progress updates reactively as the game tick advances",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Progress bar on active node card (mini 4px), in detail panel, and in summary bar at top of page. Shows percentage and estimated time remaining. Also a PanelResearchSummaryComponent sidebar panel in game-play for at-a-glance progress."
    }
  ]
}
