{
  "project": "Blunderdark",
  "branchName": "ralph/grid-system",
  "description": "Grid System - Foundational 20x20 tile grid for dungeon building, with reactive state, visual rendering, tile selection, and save/load persistence.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define grid tile data structure",
      "description": "As a developer, I want a well-typed grid tile data structure so that each tile tracks its occupation state, room association, and connection type.",
      "acceptanceCriteria": [
        "A GridTile type is defined in src/app/interfaces/ with fields: occupied: boolean, roomId: string | null, connectionType: string | null",
        "A GridState type is defined representing the full 20x20 grid (array of arrays or flat array with accessor helpers)",
        "Grid coordinates use (x, y) from (0,0) top-left to (19,19) bottom-right",
        "Types use type keyword, not interface, per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Pre-existing: GridTile and GridState types in src/app/interfaces/grid.ts with GRID_SIZE constant"
    },
    {
      "id": "US-002",
      "title": "Implement grid state management",
      "description": "As a developer, I want grid state managed via Angular Signals so that changes propagate reactively through the UI.",
      "acceptanceCriteria": [
        "A grid state helper file exists at src/app/helpers/grid.ts that creates and manages grid state",
        "Grid state is initialized as a 20x20 grid of empty tiles",
        "Functions exist: getTile(x, y), setTile(x, y, tile), resetGrid(), isInBounds(x, y)",
        "Grid state integrates with GameState.world in state-game.ts for persistence via indexedDbSignal",
        "Unit tests cover getTile, setTile, isInBounds, and resetGrid in src/app/helpers/grid.spec.ts",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Pre-existing: grid.ts helpers + grid.spec.ts with 15 tests (122 total passing)"
    },
    {
      "id": "US-003",
      "title": "Render grid in game-play page",
      "description": "As a player, I want to see the dungeon grid rendered visually so that I can understand the spatial layout of my dungeon.",
      "acceptanceCriteria": [
        "A GridComponent (standalone, OnPush) renders the 20x20 grid as a visual tile map",
        "Each tile is rendered as a distinct cell with visible borders",
        "Empty tiles are visually distinguishable from occupied tiles",
        "The grid component is displayed on the game-play page",
        "Grid renders correctly at default zoom level",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Pre-existing: GridComponent (OnPush) in src/app/components/grid/ with 20x20 CSS grid, .occupied/.selected classes, displayed on game-play page"
    },
    {
      "id": "US-004",
      "title": "Tile selection and highlighting",
      "description": "As a player, I want to click on a tile to select it and see it highlighted so that I can inspect or target specific tiles.",
      "acceptanceCriteria": [
        "Clicking a tile selects it and applies a highlight style (colored border or overlay)",
        "Only one tile can be selected at a time (clicking another tile deselects the previous)",
        "A signal exposes the currently selected tile coordinates (selectedTile: Signal<{x: number, y: number} | null>)",
        "Pressing Escape or clicking the same tile again deselects it",
        "Hovering over a tile shows a subtle hover effect distinct from selection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Pre-existing: selectedTile signal, selectTile/deselectTile in grid.ts, Escape key handler via host binding, hover/selected CSS styles in grid.component.scss"
    },
    {
      "id": "US-005",
      "title": "Grid save and load",
      "description": "As a player, I want my grid state to persist across sessions so that my dungeon layout is saved.",
      "acceptanceCriteria": [
        "Grid state is included in the GameStateWorld type in state-game.ts",
        "Grid state serializes to a JSON-compatible format (no class instances)",
        "On game load, grid state is restored from IndexedDB and the grid renders the saved layout",
        "A new game initializes a fresh empty grid",
        "Unit tests verify serialization round-trip (serialize then deserialize produces identical grid)",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Pre-existing: GridState in GameStateWorld, JSON round-trip test in grid.spec.ts, createEmptyGrid() used in defaults.ts"
    }
  ]
}
