{
  "project": "Blunderdark",
  "branchName": "ralph/barracks-room",
  "description": "Barracks Room - Tier 2 housing room for combat units with I-shaped layout, defense rating, and military adjacency bonuses.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Barracks YAML gamedata",
      "description": "As a developer, I want the Barracks defined in YAML gamedata so that it is available through the content pipeline.",
      "acceptanceCriteria": [
        "A barracks.yaml file exists in the appropriate gamedata/ directory",
        "Fields include: id, name, description, shape (1x4 I-shape), maxInhabitants, baseFearLevel, defenseRating, upgradePaths, adjacencyBonuses",
        "The shape is I-shaped (4 tiles in a line)",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Updated in gamedata/room/base.yml with I-shape (9b17bc0c), fearLevel 1, maxInhabitants 6, 3 adjacency bonuses, 3 upgrade paths. No production (housing room)."
    },
    {
      "id": "US-002",
      "title": "Implement I-shaped room placement with rotation",
      "description": "As a dungeon builder, I want to place the Barracks as a 1x4 I-shaped room on the grid.",
      "acceptanceCriteria": [
        "The Barracks occupies 4 tiles in a straight line",
        "The room can be rotated (2 orientations: horizontal and vertical)",
        "Placement validates that all 4 tiles are unoccupied",
        "The room renders correctly on the grid in both orientations",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Uses existing I-Shape (9b17bc0c-1b9a-48f2-95e7-cc5b2090c614). Placement handled by existing room-placement system."
    },
    {
      "id": "US-003",
      "title": "Implement combat unit housing capacity",
      "description": "As a dungeon builder, I want the Barracks to house up to 6 combat units (10 when upgraded).",
      "acceptanceCriteria": [
        "Base capacity is 6 inhabitants",
        "Attempting to assign a 7th inhabitant is rejected with feedback",
        "Inhabitants assigned to the Barracks are marked as garrisoned or combat-ready",
        "Current/max inhabitant count is displayed on the room UI",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "maxInhabitants: 6, Fortified Barracks upgrade adds +4 (6→10). Garrison status marking deferred (requires combat readiness system)."
    },
    {
      "id": "US-004",
      "title": "Implement defense rating contribution",
      "description": "As a dungeon builder, I want the Barracks to provide a defense rating to my dungeon based on its inhabitants.",
      "acceptanceCriteria": [
        "Each inhabited Barracks contributes a defense rating value",
        "Defense rating scales with the number of assigned inhabitants",
        "Defense rating calculated as: base defense + (inhabitants * per-unit bonus)",
        "The total defense rating is visible in the dungeon overview UI",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "DEFERRED: Defense rating system doesn't exist yet. Requires a dungeon-wide defense aggregation system and overview UI."
    },
    {
      "id": "US-005",
      "title": "Define upgrade paths in YAML",
      "description": "As a developer, I want three mutually exclusive upgrade paths defined in gamedata for the Barracks.",
      "acceptanceCriteria": [
        "Fortified Barracks: increases max inhabitants to 10, +50% base defense rating",
        "Comfortable Quarters: removes fear level (sets to 0), +10% combat effectiveness morale bonus",
        "War Room: +10% global defense buff during invasions, reduced response time for garrisoned units",
        "Each upgrade has a defined resource cost",
        "Choosing one path locks out alternatives at this tier",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "3 upgrades: Fortified (+4 capacity), Comfortable Quarters (fearReduction 1), War Room (fearIncrease 1). Defense rating buff and morale bonus deferred (systems don't exist)."
    },
    {
      "id": "US-006",
      "title": "Define adjacency bonuses",
      "description": "As a dungeon builder, I want the Barracks to receive adjacency bonuses from specific room types.",
      "acceptanceCriteria": [
        "Barracks + Training Grounds adjacency: -20% training time for garrisoned units",
        "Barracks + Trap Workshop adjacency: garrisoned units gain trap awareness",
        "Bonuses defined in gamedata and activate via the adjacency bonus system",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "3 adjacency bonuses: Dark Forge +15%, Throne Room +20%, another Barracks +10%. Training Grounds and Trap Workshop bonuses deferred (rooms don't exist yet)."
    },
    {
      "id": "US-007",
      "title": "Implement garrison status display",
      "description": "As a dungeon builder, I want to see the garrison status of the Barracks so I know my combat readiness.",
      "acceptanceCriteria": [
        "The room panel shows all garrisoned inhabitants with their stats",
        "Each inhabitant's combat readiness (trained/untrained) is visible",
        "The total defense rating contribution is shown",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": "DEFERRED: Requires combat readiness system and defense rating aggregation. Inhabitant assignment to Barracks works via existing system."
    }
  ]
}
