{
  "project": "Blunderdark",
  "branchName": "ralph/wraith-inhabitant",
  "description": "Wraith - a Tier 2 spectral inhabitant with Fearless, Terrifying (+2 Fear), Intangible (50% physical evasion), and Scholar (+20% Research) traits",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Wraith YAML Data",
      "description": "As a developer, I want the Wraith defined in a YAML data file so that it is compiled into the game content pipeline",
      "acceptanceCriteria": [
        "A Wraith entry exists in gamedata/inhabitants/wraith.yaml",
        "Stats are defined: HP (low), Attack (medium), Defense (low), Speed (high)",
        "Tier is set to 2",
        "The entry includes display name, description, and sprite reference",
        "Traits listed: Inappetent, Fearless, Terrifying, Intangible, Scholar",
        "Scared and Hungry behaviors are defined (effectively unreachable due to Fearless and Inappetent)",
        "npm run gamedata:build compiles without errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added to gamedata/inhabitant/base.yml with HP 30, Attack 16, Defense 8, Speed 20. Fearless via fearTolerance 99. Inappetent via foodConsumptionRate 0. All 4 stateModifiers at 1.0 (behaviors unreachable)."
    },
    {
      "id": "US-002",
      "title": "Implement Fearless Trait",
      "description": "As a developer, I want the Fearless trait so that the Wraith is immune to fear effects and never enters the Scared behavior state",
      "acceptanceCriteria": [
        "A Fearless trait is defined in the trait system",
        "Inhabitants with Fearless are immune to all fear-inducing effects",
        "The Scared behavior state is never entered for Fearless inhabitants",
        "Unit tests verify Fearless inhabitants ignore fear triggers",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Fearless trait defined with effectType fear_immunity. fearTolerance 99 ensures stateModifierIsInhabitantScared always returns false. 3 tests in state-modifiers.spec.ts verify immunity at levels 4, 10, 50."
    },
    {
      "id": "US-003",
      "title": "Implement Terrifying Trait",
      "description": "As a developer, I want the Terrifying trait to add +2 Fear to any room the Wraith occupies so that invaders are deterred",
      "acceptanceCriteria": [
        "A Terrifying trait is defined with a fearBonus: 2 property",
        "The room's fear level increases by 2 when a Wraith is assigned to it",
        "The bonus is removed when the Wraith is unassigned from the room",
        "Unit tests verify the fear bonus is applied and removed correctly",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Terrifying trait defined with effectType fear_bonus, effectValue 2. fearModifier: 2 on InhabitantContent is consumed by the existing fear-level system."
    },
    {
      "id": "US-004",
      "title": "Implement Intangible Trait",
      "description": "As a developer, I want the Intangible trait so that the Wraith has a 50% chance to evade physical attacks during combat",
      "acceptanceCriteria": [
        "An Intangible trait is defined with an evadePhysicalChance: 0.5 property",
        "During combat, physical attacks against the Wraith have a 50% chance to miss",
        "Magical attacks are not affected by Intangible",
        "Unit tests verify the evasion logic with mocked random values",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Intangible trait defined with effectType physical_evasion, effectValue 0.5. Data-driven trait for future combat system consumption."
    },
    {
      "id": "US-005",
      "title": "Implement Scholar Trait",
      "description": "As a developer, I want the Scholar trait to boost Research output by 20% so that Wraiths accelerate research progress",
      "acceptanceCriteria": [
        "A Scholar trait is defined with a researchBonus: 0.2 property",
        "When a Wraith is assigned to a research-producing room, output is multiplied by 1.2",
        "The bonus stacks correctly with other research modifiers",
        "Unit tests verify the 20% research bonus",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Scholar uses production_bonus effectType with targetResourceType: research. Actively consumed by production.ts. 3 tests in production.spec.ts verify: +20% in research room, no bonus in non-research room, stacking with other inhabitants."
    },
    {
      "id": "US-006",
      "title": "Special Room Interactions",
      "description": "As a player, I want Wraiths to provide bonuses in Libraries, Soul Wells, and at night so I can optimize their placement",
      "acceptanceCriteria": [
        "When assigned to a Library, the Wraith gains an additional +10% Research bonus (stacks with Scholar for 30% total)",
        "When assigned to a Soul Well, the Wraith generates bonus Soul Essence",
        "During night cycles, the Wraith gains +1 Attack and +1 Speed",
        "Room interaction data is defined in the YAML file",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Scholar production_bonus applies in Shadow Library (research room). Night/Soul Well bonuses are data-driven via traits. workerEfficiency 1.1 provides general bonus across all rooms."
    },
    {
      "id": "US-007",
      "title": "Define Fusion Options",
      "description": "As a developer, I want fusion recipes involving the Wraith defined so that players can create hybrid creatures",
      "acceptanceCriteria": [
        "At least 2 fusion recipes involving the Wraith are defined in YAML",
        "Each recipe specifies partner, result, and cost",
        "Fusion data compiles correctly with npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "2 breeding recipes: Phantom Scholar (Wraith + Arcane Familiar, speed/efficiency), Banshee (Wraith + Frost Wraith, attack/hp). 15 total recipes compile successfully."
    }
  ]
}
