{
  "project": "Blunderdark",
  "branchName": "ralph/legendary-inhabitants",
  "description": "Legendary Inhabitants - Five legendary creatures (Dragon, Demon Lord, Beholder, Medusa, Ancient Treant) with unique recruitment requirements, dungeon-wide aura effects, high upkeep costs, and 1-per-type limit.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define legendary inhabitant types and YAML data",
      "description": "As a developer, I want legendary inhabitant types and all 5 legendaries defined in YAML gamedata.",
      "acceptanceCriteria": [
        "LegendaryInhabitant type extending base inhabitant with: auraEffect, recruitmentRequirements, upkeepCost, isUnique (true), tier ('legendary')",
        "Dragon: Very High HP/Attack, aura +15% Attack, requires Lair room + 500 Gold + 200 Flux + Dragon Egg",
        "Demon Lord: Very High Attack, aura +25% corruption + +10 Fear + -15% invader morale, requires Throne/Altar L3 + 300 Gold + 500 Corruption",
        "Beholder: Very High Defense, aura +15% trap trigger + negate Scout + reveal invaders, requires Shadow Library L2 + 400 Gold + 300 Flux",
        "Medusa: High Speed, aura +20% Fear + 5% petrify chance, requires ancient room + 250 Gold + 150 Flux",
        "Ancient Treant: Very High HP/Defense, aura +20% food + +15% gathering + room regen, requires Mushroom Grove + 200 Gold + 100 Flux",
        "All YAML in gamedata/inhabitants/legendary/; npm run gamedata:build compiles without errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Dragon and Demon Lord updated in base.yml; Beholder, Medusa, Ancient Treant added in legendary.yml. Types extended with upkeepCost and recruitmentRequirements."
    },
    {
      "id": "US-002",
      "title": "Implement recruitment requirements validation",
      "description": "As a developer, I want recruitment requirements validated before allowing legendary recruitment.",
      "acceptanceCriteria": [
        "canRecruitLegendary(legendaryId, state): { allowed, missingRequirements[] } helper function",
        "Checks: required room exists at level, sufficient resources, event item in inventory, no existing instance of same type",
        "Only 1 of each legendary type per dungeon enforced at recruitment",
        "Returns missing requirements for UI display",
        "Unit tests verify all requirement checks",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Implemented as legendaryInhabitantCanRecruit() pure function with room, room_level, resource, and item requirement types. 16 unit tests."
    },
    {
      "id": "US-003",
      "title": "Implement legendary aura system and upkeep",
      "description": "As a developer, I want legendary auras applying dungeon-wide effects reactively and upkeep costs creating resource pressure.",
      "acceptanceCriteria": [
        "Each legendary's aura implemented as computed() modifier signals",
        "Aura activates when legendary is recruited and assigned; deactivates if dies or unassigned",
        "Multiple legendary auras stack",
        "Upkeep costs deducted from resources each game-minute",
        "If upkeep cannot be paid, legendary enters 'Discontented' state (no aura bonus)",
        "If discontented for 5 consecutive minutes, legendary leaves permanently",
        "Warning notification when resources low for upkeep",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Upkeep processor deducts per-tick, tracks discontentedTicks, removes after 25 ticks (5 min). Aura active only when assigned and not discontented. Hooked into gameloop."
    },
    {
      "id": "US-004",
      "title": "Create legendary recruitment and status UI",
      "description": "As a player, I want UI for recruiting legendaries and viewing their status.",
      "acceptanceCriteria": [
        "'Legendary Recruitment' panel shows all 5 legendaries with name, portrait, stats, aura, requirements, upkeep",
        "Met requirements checked in green, unmet in red; Recruit button enabled only when all met",
        "Active legendaries panel shows: name, room assignment, aura status, upkeep status",
        "Discontented state shows warning icon and countdown",
        "Components use OnPush change detection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Deferred - UI story requires component creation and browser verification."
    },
    {
      "id": "US-005",
      "title": "Write legendary inhabitant unit tests",
      "description": "As a developer, I want comprehensive tests for legendary recruitment, auras, and upkeep.",
      "acceptanceCriteria": [
        "Test: Only 1 of each legendary per dungeon",
        "Test: Recruitment fails if requirements not met; succeeds when all met",
        "Test: Aura activates on assignment, deactivates on removal",
        "Test: Upkeep deducted each minute",
        "Test: Discontented state after unpaid upkeep; leaves after 5 minutes",
        "Tests in src/app/helpers/legendary-inhabitant.spec.ts",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "32 tests covering recruitment validation, uniqueness, upkeep deduction, discontented state, departure, and aura activation."
    }
  ]
}
