{
  "project": "Blunderdark",
  "branchName": "ralph/floor-navigation-ui",
  "description": "Floor Navigation UI - Intuitive UI for navigating between dungeon floors including a floor selector, current floor indicator, minimap overview, keyboard shortcuts, and render optimization.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create FloorSelector component",
      "description": "As a player, I want a floor selector so that I can switch between dungeon floors easily.",
      "acceptanceCriteria": [
        "Create FloorSelectorComponent showing all available floors",
        "Each floor entry shows: depth number, floor name, room count",
        "Clicking a floor switches the active view by updating FloorService.currentFloor signal",
        "Current floor is highlighted in the selector",
        "Component uses OnPush change detection and standalone conventions",
        "Uses @for native control flow for floor list rendering",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "FloorSelector already existed. Added depth number and room count to each floor entry."
    },
    {
      "id": "US-002",
      "title": "Display current floor indicator and keyboard shortcuts",
      "description": "As a player, I want to see which floor I am viewing and use keyboard shortcuts to navigate floors quickly.",
      "acceptanceCriteria": [
        "Current floor number displayed prominently in the game UI header (e.g., 'Floor 3 / 10')",
        "Indicator updates immediately when floor changes",
        "Page Up switches to floor above (lower depth), Page Down to floor below (higher depth)",
        "Shortcuts do nothing at top or bottom floor boundaries",
        "Shortcuts are disabled during invasion mode",
        "Keyboard shortcuts registered via host bindings on the appropriate component",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Floor indicator added to resource bar area. PageUp/PageDown via host bindings on GamePlayComponent. Invasion mode disable deferred (no global invasion active signal exists yet)."
    },
    {
      "id": "US-003",
      "title": "Create floor minimap component",
      "description": "As a player, I want a minimap showing all floors so that I can get an overview of my dungeon.",
      "acceptanceCriteria": [
        "A small minimap panel shows all created floors stacked vertically",
        "Each floor shown as a simplified grid with room outlines using CSS grid (not full tile rendering)",
        "Current floor is highlighted in the minimap",
        "Clicking a floor in the minimap switches to it",
        "Component uses OnPush change detection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Created PanelFloorMinimapComponent with 3px CSS grid tiles, biome-colored room indicators, and click-to-switch."
    },
    {
      "id": "US-004",
      "title": "Implement render optimization for floor switching",
      "description": "As a developer, I want only the current floor to be fully rendered so that multi-floor dungeons remain performant.",
      "acceptanceCriteria": [
        "Only the current floor's grid and rooms are rendered in the main view",
        "Non-active floors are not in the DOM (use @if for conditional rendering)",
        "Floor switch triggers a render of the new floor's data",
        "Floor switch is visually smooth with no flicker or long delay (under 100ms)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Already optimized: grid reads from floorCurrent() computed signal, only current floor data is ever in the DOM."
    }
  ]
}
