{
  "project": "Blunderdark",
  "branchName": "ralph/inhabitant-assignment-system",
  "description": "Inhabitant Assignment System - Allows players to assign inhabitants to rooms with capacity enforcement, production recalculation on changes, and visual indicators of assignment status.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement assignment validation and capacity enforcement",
      "description": "As a developer, I want room capacity enforced with assignment helpers so that rooms cannot exceed their inhabitant limits.",
      "acceptanceCriteria": [
        "Each room type defines maxInhabitants in its gamedata YAML",
        "A validation function canAssignToRoom(roomId) checks current count vs max",
        "Attempting to assign when full returns an error message",
        "No inhabitant can be double-assigned to two rooms simultaneously",
        "Assignment logic located in src/app/helpers/assignment.ts",
        "Unit tests verify capacity enforcement for rooms at 0, partial, and full capacity",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Implemented in assignment.ts with canAssignToRoom, getAssignmentCount, isInhabitantAssigned, getRoomAssignmentInfo. 17 unit tests in assignment.spec.ts."
    },
    {
      "id": "US-002",
      "title": "Implement assign and unassign UI with room detail panel",
      "description": "As a player, I want to assign and unassign inhabitants to rooms via a room detail panel.",
      "acceptanceCriteria": [
        "Clicking a placed room opens a room detail panel showing name, type, and production stats",
        "Panel shows assignment slots: filled slots with inhabitant names, empty slots with 'Empty' placeholder",
        "Clicking an empty slot shows a list of unassigned inhabitants (computed signal filtering assignedRoomId === null)",
        "Clicking an inhabitant from the list assigns them (updates assignedRoomId in game state)",
        "Clicking a filled slot shows an 'Unassign' option that sets assignedRoomId to null",
        "UI disables/hides assign option when room is full",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Panel-room-info shows room name, production rates (per-minute), assigned inhabitants with Remove buttons, and eligible unassigned inhabitants with Assign buttons. Fixed pre-existing typecheck errors in spec files."
    },
    {
      "id": "US-003",
      "title": "Trigger production recalculation on assignment changes",
      "description": "As a developer, I want production to recalculate when assignments change so that resource generation reflects the workforce.",
      "acceptanceCriteria": [
        "Assigning an inhabitant triggers production recalculation for that room",
        "Unassigning an inhabitant triggers production recalculation for that room",
        "Production rate signal updates immediately within the same tick",
        "Resource UI display reflects the new rates",
        "Unit tests verify production changes when inhabitants are assigned/unassigned",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Production recalculation is automatic via Angular signals — gamestate change triggers computed signal recomputation. Added 3 explicit tests in production.spec.ts verifying production changes on assignment/unassignment."
    },
    {
      "id": "US-004",
      "title": "Display assignment status indicators on grid rooms",
      "description": "As a player, I want visual indicators on rooms showing assignment status so that I can spot understaffed rooms.",
      "acceptanceCriteria": [
        "Each placed room shows a small 'X/Y' indicator (assigned/max)",
        "Fully staffed rooms show a green indicator",
        "Partially staffed rooms show a yellow indicator",
        "Empty rooms (requiring inhabitants) show a red indicator",
        "Indicators are small and do not obscure the room visual",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added roomAssignmentMap computed signal to grid component. X/Y badges rendered on anchor tiles with color coding: green (full), yellow (partial), red (empty). Rooms with maxInhabitants=0 show no badge."
    }
  ]
}
