{
  "project": "Blunderdark",
  "branchName": "ralph/animation-system",
  "description": "Animation System - Unified animation framework for sprite-sheet entity animations and UI transitions.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define sprite atlas animation metadata in YAML",
      "description": "As a developer, I want animation frame sequences defined in gamedata YAML so that the content pipeline can generate atlas metadata for animations.",
      "acceptanceCriteria": [
        "YAML schema supports defining animation sequences per entity (frame indices, frame rate, loop behavior)",
        "Build scripts (npm run gamedata:build) process animation metadata",
        "ContentService loads animation metadata at app init",
        "AtlasAnimationComponent reads animation data from ContentService",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Create AnimationService controller",
      "description": "As a developer, I want an AnimationService that manages animation states and transitions for game entities.",
      "acceptanceCriteria": [
        "AnimationService is created as a singleton service (providedIn: 'root')",
        "Service tracks animation states per entity: idle, work, attack, hit, death",
        "Service provides methods to transition between states with optional callbacks on completion",
        "Animation state changes are driven by game state signals",
        "Service handles animation priority (e.g., death overrides idle)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement inhabitant idle animations",
      "description": "As a player, I want my dungeon inhabitants to have idle animations so that the dungeon feels alive.",
      "acceptanceCriteria": [
        "Idle animation frames are defined in the sprite atlas for each inhabitant type",
        "AtlasAnimationComponent plays idle animation by default when no other animation is active",
        "Idle animations loop continuously at a configurable frame rate",
        "Different inhabitant types can have different idle animation lengths",
        "Animations pause when the game loop is paused",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement inhabitant work animations",
      "description": "As a player, I want to see inhabitants performing work animations when assigned to a room.",
      "acceptanceCriteria": [
        "Work animation frames are defined per inhabitant-room combination or per room type",
        "Work animation plays when an inhabitant is actively generating resources",
        "Animation transitions smoothly from idle to work and back",
        "Work animation speed can scale with game tick rate or production speed",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Implement combat attack animations",
      "description": "As a player, I want combat participants to have attack animations so that battles are visually engaging.",
      "acceptanceCriteria": [
        "Attack animation frames are defined in the sprite atlas",
        "Attack animation plays once per attack action (not looping)",
        "Animation has clear windup and impact frames",
        "After attack animation completes, entity returns to idle or hit/death if applicable",
        "Both inhabitants and invaders have attack animations",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Implement hit and death animations",
      "description": "As a player, I want entities to show hit reactions and death animations so that combat damage is visually communicated.",
      "acceptanceCriteria": [
        "Hit animation is a brief flash/flinch that plays when an entity takes damage",
        "Death animation plays once when an entity's HP reaches zero",
        "Death animation does not loop; entity is removed or grayed out after completion",
        "Hit animation can interrupt idle or work and return to the previous state",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Implement UI page transition animations",
      "description": "As a player, I want smooth transitions when navigating between pages so that the UI feels polished.",
      "acceptanceCriteria": [
        "Pages fade in/out during navigation (200-300ms duration)",
        "The transition page (TransitionComponent) shows a smooth loading animation",
        "Animations do not delay route activation",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Implement modal dialog animations",
      "description": "As a player, I want modals to animate in and out so that they feel responsive and polished.",
      "acceptanceCriteria": [
        "ModalComponent animates in with a scale-up + fade-in effect",
        "ModalComponent animates out with a scale-down + fade-out effect",
        "Animation duration is 150-250ms",
        "Backdrop fades in/out alongside the modal",
        "Animations respect prefers-reduced-motion media query",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Implement room placement animation",
      "description": "As a player, I want a visual animation when I place a new room so that the action feels satisfying.",
      "acceptanceCriteria": [
        "When a room is placed, a brief build animation plays (scale from 0 to 1, slight bounce)",
        "The room briefly glows or pulses after placement",
        "Animation duration is 300-500ms",
        "Animation does not block subsequent room placement",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Add animation speed/toggle option",
      "description": "As a player, I want to control animation speed or disable animations for performance or preference.",
      "acceptanceCriteria": [
        "GameOptions includes a showAnimations boolean option, defaulting to true",
        "When disabled, sprite entities show a static frame and UI transitions are instant",
        "Option respects prefers-reduced-motion media query as a default",
        "Setting persists via localStorageSignal",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    }
  ]
}
