{
  "project": "Blunderdark",
  "branchName": "ralph/dark-forge-room",
  "description": "Dark Forge Room - A Tier 2 crafting room with a 2x2 square footprint that converts raw resources into equipment and upgrades, supports 2-4 inhabitants, has medium fear level, crafting queue, and adjacency bonuses with Mines, Training Grounds, and Trap Workshops.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Dark Forge room in YAML gamedata",
      "description": "As a developer, I want the Dark Forge defined in YAML gamedata so that it is available through the content pipeline.",
      "acceptanceCriteria": [
        "A dark-forge.yaml file exists in the appropriate gamedata/ directory for rooms",
        "Fields include: id (UUID), name, description, shape (2x2 square tile offsets), maxInhabitants (2), baseFearLevel (2 - Medium), upgradePaths, craftingRecipes, adjacencyBonuses",
        "The shape is a 2x2 square defined as a list of 4 tile offsets",
        "Adjacency bonuses defined: Forge+Mine (+30% crafting speed), Forge+Training Grounds (+1 bonus stat), Forge+Trap Workshop (+20% trap effectiveness)",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Dark Forge defined in gamedata/room/base.yml with 2x2 shape, role: darkForge, maxInhabitants: 2, fearLevel: 2, adjacency bonuses on Crystal Mine/Training Grounds/Trap Workshop"
    },
    {
      "id": "US-002",
      "title": "Define crafting recipes and upgrade paths in gamedata",
      "description": "As a developer, I want crafting recipes and upgrade paths defined for the Dark Forge so that the crafting system has content to work with.",
      "acceptanceCriteria": [
        "At least 3 equipment recipes defined (e.g., Iron Sword, Dark Shield, Shadow Armor) with input resources and output equipment",
        "At least 2 upgrade recipes defined (e.g., Reinforced Walls, Enhanced Production Module) with input resources and output upgrade items",
        "Each recipe specifies crafting time duration",
        "Master Forge upgrade path: +2 inhabitant capacity, -25% crafting time, defined resource cost",
        "Infernal Forge upgrade path: unlocks 2+ advanced recipes, crafted items gain bonus stats, defined resource cost",
        "Upgrade paths are mutually exclusive at the same tier",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "7 recipes in gamedata/forgerecipe/base.yml (3 equipment basic, 2 upgrade basic, 2 equipment advanced). Master Forge and Infernal Forge upgrade paths defined as tier 1 (mutually exclusive)."
    },
    {
      "id": "US-003",
      "title": "Implement Dark Forge placement and rendering",
      "description": "As a dungeon builder, I want to place the Dark Forge as a 2x2 square room on the grid so that it occupies the correct tiles and renders properly.",
      "acceptanceCriteria": [
        "The Dark Forge occupies a 2x2 square of tiles (4 tiles total)",
        "Placement validates that all 4 tiles are unoccupied before placing",
        "The room renders correctly on the grid with the Forge sprite",
        "No rotation needed for symmetric 2x2 shape",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Uses existing 2x2 square shape (cedc340b). Placement and rendering handled by existing room-placement system."
    },
    {
      "id": "US-004",
      "title": "Implement crafting queue and progress system",
      "description": "As a dungeon builder, I want to queue crafting jobs in the Dark Forge and see progress so that I can plan my equipment production.",
      "acceptanceCriteria": [
        "Crafting requires at least 1 inhabitant assigned to the Forge",
        "Multiple crafting jobs can be queued up to a defined maximum",
        "Each job shows a progress bar or percentage in the UI",
        "Crafting consumes the defined input resources when started",
        "Completed items are automatically added to the player's inventory",
        "More inhabitants reduce crafting time per item",
        "Crafting queue state is persisted to game state in IndexedDB",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "dark-forge.ts helper with FIFO queue (max 5), worker speed scaling, tick-based progress. Panel UI shows queue, progress bars, recipe list, and inventory. 35 unit tests passing."
    },
    {
      "id": "US-005",
      "title": "Implement inhabitant capacity and room upgrades",
      "description": "As a dungeon builder, I want the Dark Forge to support inhabitants and upgrades so that I can enhance its capabilities.",
      "acceptanceCriteria": [
        "Base capacity is 2 inhabitants; assigning beyond capacity is rejected with feedback",
        "Current/max inhabitant count is displayed on the room UI",
        "Master Forge upgrade increases max inhabitants to 4 and reduces crafting time by 25%",
        "Infernal Forge upgrade unlocks advanced recipes and adds bonus stats to crafted equipment",
        "Choosing one upgrade path locks out the alternative at that tier",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Base capacity 2, Master Forge adds +2 capacity + forgingSpeedMultiplier 0.75. Infernal Forge adds forgingTierUnlock + forgingStatBonus. Mutually exclusive at tier 1. Existing room-upgrades system handles enforcement."
    }
  ]
}
