{
  "project": "Blunderdark",
  "branchName": "ralph/prestige-features",
  "description": "Prestige Features - Five rare, powerful room attachments (Elder Runes, Void Gate, Time Dilation Field, Phylactery, Dragon's Hoard Core) with dramatic effects, high costs, and unique constraint enforcement.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define all prestige features in YAML gamedata",
      "description": "As a developer, I want all five prestige features defined in YAML so that they integrate with the content pipeline.",
      "acceptanceCriteria": [
        "All five prestige features defined in gamedata/feature/ YAML files",
        "Elder Runes: high cost, +50% production, magical room tag",
        "Void Gate: high cost, daily creature summon (70% beneficial, 30% hostile)",
        "Time Dilation Field: high cost, 150% speed, maintenance resource cost",
        "Phylactery: high cost, undead respawn with 75% stats, 30s delay, limited charges",
        "Dragon's Hoard Core: very high cost, +5 Gold/min, +100% Gold storage, unique: true flag",
        "Each definition includes: id, name, description, category (prestige), cost, bonuses",
        "Cost values significantly higher than environmental and functional features",
        "npm run gamedata:build compiles without errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement unique feature constraint system and ContentService integration",
      "description": "As a developer, I want unique feature constraints enforced and prestige features queryable by category.",
      "acceptanceCriteria": [
        "Features with unique: true flag can only exist once in the dungeon",
        "isUniqueFeaturePlaced(featureId) helper scans all rooms for the feature",
        "Feature attachment system checks unique constraint before allowing attachment",
        "Attempting to attach a second unique feature shows error message",
        "Removing a unique feature allows placing it in a different room",
        "ContentService serves prestige features queryable by category",
        "Unit tests verify unique constraint enforcement",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement Elder Runes and Time Dilation Field effects",
      "description": "As a developer, I want Elder Runes and Time Dilation Field to modify room production and speed.",
      "acceptanceCriteria": [
        "Elder Runes: room production increases by 50% for all resource types",
        "Elder Runes: room gains magical tag queryable by other systems",
        "Time Dilation Field: all production, XP gain, and timers run at 150% speed",
        "Time Dilation Field: room consumes additional resources per tick as maintenance",
        "Time Dilation Field: deactivates temporarily if maintenance resources unavailable",
        "Unit tests verify production bonus, magical tag, speed multiplier, and maintenance",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement Void Gate, Phylactery, and Dragon's Hoard Core effects",
      "description": "As a developer, I want Void Gate summons, Phylactery respawns, and Dragon's Hoard gold generation to function.",
      "acceptanceCriteria": [
        "Void Gate: once per in-game day summons random creature from weighted pool",
        "Void Gate: hostile creatures (30%) attack inhabitants in room on arrival",
        "Void Gate: cooldown timer shows when next summon occurs",
        "Phylactery: dead inhabitants respawn as undead with 75% stats after 30s delay",
        "Phylactery: maximum respawns before consumed",
        "Dragon's Hoard Core: generates 5 Gold/min and doubles Gold storage capacity",
        "Unit tests verify summon frequency, respawn mechanics, and Gold bonuses",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    }
  ]
}
