{
  "project": "Blunderdark",
  "branchName": "ralph/camera-controls",
  "description": "Camera Controls - Pan and zoom controls for navigating the dungeon grid with mouse, keyboard, and bounds enforcement.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement camera state signals",
      "description": "As a developer, I want camera state managed via signals so that position and zoom are reactive.",
      "acceptanceCriteria": [
        "Camera state helper exists at src/app/helpers/camera.ts",
        "cameraPosition signal tracks {x, y} offset",
        "cameraZoom signal tracks zoom level",
        "Camera transforms applied via CSS transform: translate() scale() on the grid container",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "camera.ts helper created with cameraPosition, cameraZoom, cameraTransform signals. Transform applied via [style.transform] on grid-container with transform-origin: 0 0."
    },
    {
      "id": "US-002",
      "title": "Implement mouse drag panning",
      "description": "As a player, I want to drag the grid with my mouse so that I can pan around the dungeon.",
      "acceptanceCriteria": [
        "Middle-mouse-button drag or left-mouse drag on empty space pans the camera",
        "Panning is smooth (no stuttering or snapping)",
        "Pan direction follows the mouse movement intuitively",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Mouse drag panning via onCameraMouseDown/Move/Up. 5px threshold before drag activates. wasDragging flag prevents accidental tile clicks after drag."
    },
    {
      "id": "US-003",
      "title": "Implement keyboard panning (WASD/arrows)",
      "description": "As a player, I want to pan the camera using WASD keys so I can navigate without the mouse.",
      "acceptanceCriteria": [
        "W/A/S/D keys pan the camera up/left/down/right",
        "Arrow keys also work as alternatives",
        "Pan speed is consistent and comfortable (configurable constant)",
        "Key panning does not interfere with text input fields",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "WASD and arrow keys via host bindings. CAMERA_PAN_SPEED=40. Skips input/textarea/contentEditable targets and modal-open state."
    },
    {
      "id": "US-004",
      "title": "Implement mouse wheel zoom",
      "description": "As a player, I want to zoom in and out with the mouse wheel.",
      "acceptanceCriteria": [
        "Mouse wheel up zooms in, down zooms out",
        "Zoom has min/max limits (e.g., 0.5x to 3x)",
        "Zoom is centered on the mouse cursor position",
        "Zoom transitions are smooth (not instant snapping)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Mouse wheel zoom via onWheel handler. Dynamic min zoom (fits grid in viewport) to 3x max. Cursor-centered via inverse-transform math."
    },
    {
      "id": "US-005",
      "title": "Enforce camera bounds",
      "description": "As a player, I want the camera to stop at grid edges so I cannot scroll into empty space.",
      "acceptanceCriteria": [
        "Camera cannot pan beyond the grid boundaries (accounts for current zoom level)",
        "At minimum zoom, the entire grid is visible and no further zoom-out is allowed",
        "Bounds are recalculated when zoom level changes",
        "Attempting to pan beyond bounds clamps the position silently",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "cameraClampPosition centers grid when smaller than viewport, clamps to edges when larger. Effective min zoom computed from viewport dimensions. ResizeObserver recalculates on viewport resize."
    },
    {
      "id": "US-006",
      "title": "Implement reset camera button",
      "description": "As a player, I want a reset button that returns the camera to its default position and zoom.",
      "acceptanceCriteria": [
        "A Reset Camera button is visible in the game UI",
        "Clicking it resets camera position to center of grid and zoom to 1x",
        "Reset transition is smooth (animated, not instant)",
        "Home key keyboard shortcut also triggers reset",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Reset button in bottom-right of grid viewport. Home key shortcut via host binding. Smooth animation via .camera-animating CSS class with 0.3s transition."
    }
  ]
}
