{
  "project": "Blunderdark",
  "branchName": "ralph/efficiency-calculation",
  "description": "Efficiency Calculation - Reads inhabitant traits and computes how they modify room production, with trait-room matching, additive stacking, real-time reactive updates, and UI display of efficiency breakdowns.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement efficiency trait extraction and room calculation",
      "description": "As a developer, I want to extract efficiency traits from inhabitants and calculate per-room efficiency bonuses so that production reflects the workforce.",
      "acceptanceCriteria": [
        "A function getEfficiencyTraits(inhabitantInstance) returns efficiency-related traits identified by effectType === 'production_bonus'",
        "Each trait specifies: target resource type (or 'all') and bonus percentage",
        "A function calculateRoomEfficiency(roomId, gameState) returns the efficiency multiplier for the room",
        "Function iterates all inhabitants assigned to the room and sums their efficiency bonuses additively (two +20% = 1.4 multiplier)",
        "Room with no assigned inhabitants returns multiplier of 1.0",
        "Functions handle inhabitants with no efficiency traits (returns empty array / no bonus)",
        "Helpers located in src/app/helpers/efficiency.ts",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement trait-room matching logic",
      "description": "As a developer, I want efficiency traits to match specific room production types so that placing the right inhabitant in the right room matters.",
      "acceptanceCriteria": [
        "Traits with a specific targetResourceType only apply when the room produces that resource",
        "Traits with targetResourceType 'all' apply to any room",
        "A Goblin with 'Miner' (+20% crystals) gets the bonus in a Crystal Mine but not in a Farm",
        "Mismatched traits contribute 0% bonus (inhabitant present but trait does not apply)",
        "Unit tests in src/app/helpers/efficiency.spec.ts cover: matching trait, non-matching trait, 'all' trait, mixed traits",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Create reactive efficiency signals",
      "description": "As a developer, I want efficiency exposed as computed signals so that production rates update in real-time when assignments change.",
      "acceptanceCriteria": [
        "Efficiency is exposed as a computed signal per room: roomEfficiency(roomId) returning Signal<number>",
        "Signal recomputes when inhabitants are assigned or unassigned from the room",
        "An averageDungeonEfficiency() computed signal returns the average efficiency across all production rooms",
        "A totalEfficiencyBonusForResource(resourceType) computed signal returns the sum of all efficiency bonuses for a specific resource",
        "Production system consumes the room efficiency signal in its calculation",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Display efficiency breakdown in room detail panel",
      "description": "As a player, I want to see the efficiency bonus for a room so that I understand how my inhabitants affect production.",
      "acceptanceCriteria": [
        "The room detail panel shows the current efficiency multiplier (e.g., 'Efficiency: 140%')",
        "A breakdown shows each assigned inhabitant's contribution (e.g., 'Goblin: +20% (Miner)')",
        "Base efficiency (100%) is shown separately from inhabitant bonuses",
        "If efficiency is below 100% due to conditional states, the penalty is shown in red",
        "Component uses OnPush change detection and standalone component conventions",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Write unit tests for efficiency calculation",
      "description": "As a developer, I want comprehensive unit tests for efficiency calculation so that trait-based bonuses are reliable.",
      "acceptanceCriteria": [
        "Tests cover: empty room returns 1.0, one worker with trait, multiple workers additive stacking",
        "Tests cover: workers with different trait types, inhabitant with no efficiency traits",
        "Tests cover: aggregate efficiency across multiple rooms",
        "Tests located in src/app/helpers/efficiency.spec.ts",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ]
}
