{
  "project": "Blunderdark",
  "branchName": "ralph/fusion-interface",
  "description": "Fusion Interface - UI system for selecting two inhabitants and fusing them into a hybrid creature, with result previews, cost display, confirmation flow, recipe browser, and state persistence.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create fusion interface with inhabitant selection",
      "description": "As a dungeon builder, I want to access a fusion interface and select two inhabitants for fusion.",
      "acceptanceCriteria": [
        "A 'Fusion' button is accessible from the inhabitant roster or dedicated UI area",
        "The fusion interface opens as a modal or dedicated panel",
        "Interface is only available when the player has at least 2 inhabitants",
        "A scrollable list shows available inhabitants with name, type, stats summary, and current assignment",
        "Selecting first inhabitant highlights it in 'Slot A' and updates list for second selection",
        "Selecting second inhabitant places it in 'Slot B'",
        "Inhabitants assigned to rooms can be selected with a warning",
        "A 'Cancel' button is always visible and resets selection with no changes",
        "Component uses OnPush change detection and standalone conventions",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement fusion result preview and cost display",
      "description": "As a dungeon builder, I want to see a preview of the fusion result and its cost before committing.",
      "acceptanceCriteria": [
        "When a valid recipe exists, preview shows: hybrid name, type, sprite, predicted stats",
        "Stats shown with comparison indicators (higher/lower than parents)",
        "Inherited traits from both parents are listed, unique bonus traits highlighted",
        "If no recipe exists, 'Unknown combination' message is shown",
        "Fusion cost displayed prominently (Essence + resources) with current vs required amounts",
        "Insufficient resources highlighted in red; Confirm button disabled if resources insufficient",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement fusion confirmation and execution",
      "description": "As a dungeon builder, I want to confirm fusion to create the hybrid, atomically removing originals and deducting resources.",
      "acceptanceCriteria": [
        "Confirmation dialog warns that both original inhabitants will be permanently consumed",
        "Confirming atomically: deducts resource cost, removes both parents from roster, adds hybrid to roster",
        "If either parent was assigned to a room, that room's inhabitant slot is freed",
        "Hybrid inhabitants have a fusedFrom field recording parent IDs",
        "Success notification shows the new hybrid's details",
        "Hybrid inhabitants persist to IndexedDB as part of game state",
        "Loading a saved game correctly restores all hybrids",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement recipe browser",
      "description": "As a dungeon builder, I want to browse all available fusion recipes so that I can plan my fusions.",
      "acceptanceCriteria": [
        "A 'Recipes' tab or section in the fusion interface shows all known recipes",
        "Each recipe shows: Creature A + Creature B = Hybrid C with cost (Essence + resources)",
        "Recipes the player can currently perform (has both creatures + resources) are highlighted",
        "Recipes can be filtered or searched",
        "Recipe data loaded from compiled JSON via ContentService",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
