{
  "project": "Blunderdark",
  "branchName": "ralph/fear-level-tracking",
  "description": "Fear Level Tracking - Assigns and maintains a fear value (0-4) for each room, determined by base fear from room type plus inhabitant modifiers, with reactive signals and UI display.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define FearLevel type and helper functions",
      "description": "As a developer, I want a fear level type defined so that fear values are consistent across the codebase.",
      "acceptanceCriteria": [
        "A FearLevel const object or enum is defined with values: None(0), Low(1), Medium(2), High(3), VeryHigh(4)",
        "A helper function getFearLabel(level: number): string returns the human-readable name",
        "The type is exported from the interfaces barrel at @interfaces",
        "Type uses type keyword per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Implemented as FEAR_LEVEL_NONE/LOW/MEDIUM/HIGH/VERY_HIGH constants and FEAR_LEVEL_LABELS record in fear-level.ts. fearLevelGetLabel() returns human-readable labels. Exported via @helpers barrel (project convention for helper types)."
    },
    {
      "id": "US-002",
      "title": "Implement base fear from room type and inhabitant modification",
      "description": "As a developer, I want rooms to have base fear from gamedata and inhabitants to modify effective fear so that room composition matters.",
      "acceptanceCriteria": [
        "Room YAML definitions include a baseFearLevel field (integer 0-4)",
        "When a room is placed, its current fear level is initialized to the base",
        "Each inhabitant type defines a fearModifier value in gamedata (e.g., Skeleton: +1, Dryad: -2)",
        "Effective fear = base fear + sum of inhabitant fear modifiers, clamped to [0, 4]",
        "Assigning or removing an inhabitant triggers recalculation of effective fear",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Room YAML already has fearLevel field. Added fearModifier to InhabitantDefinition and all 8 inhabitants in base.yml. fearLevelCalculateInhabitantModifier sums modifiers, fearLevelCalculateEffective clamps to [0,4]. Also accounts for upgrade adjustments and altar aura reduction."
    },
    {
      "id": "US-003",
      "title": "Create reactive fear level signals",
      "description": "As a developer, I want fear levels exposed as Angular Signals so that dependent systems update reactively.",
      "acceptanceCriteria": [
        "Each room has a fearLevel computed signal derived from base + inhabitant modifiers",
        "The signal updates when inhabitants are added or removed from the room",
        "Other systems (propagation, modifiers, UI) can consume this signal",
        "Fear level persists in game state for save/load via IndexedDB",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "fearLevelBreakdownMap computed signal provides per-room FearLevelBreakdown derived from gamestate(). fearLevelRoomMap provides simplified roomId->effectiveFear for pathfinding. Both auto-update when gamestate changes (inhabitant assignment triggers signal cascade)."
    },
    {
      "id": "US-004",
      "title": "Display fear level in room UI panel",
      "description": "As a dungeon builder, I want to see the fear level of each room so that I can manage my dungeon atmosphere.",
      "acceptanceCriteria": [
        "Each room's UI panel shows the current fear level with icon and label",
        "Fear level is color-coded: None=white, Low=green, Medium=yellow, High=orange, VeryHigh=red",
        "If inhabitants modify fear, the modifier breakdown is shown (e.g., 'Medium (base) + 1 (Skeleton) = High')",
        "Component uses OnPush change detection and input()/computed() signals",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added fear display section to panel-room-info with DaisyUI progress bar, color-coded label (opacity-50/success/warning/orange-400/error), and breakdown showing base, inhabitant modifier, upgrade adjustment, and altar aura reduction when any modifier is non-zero."
    }
  ]
}
