{
  "project": "Blunderdark",
  "branchName": "ralph/summoning-circle-room",
  "description": "Summoning Circle room - a Tier 2 L-shaped room for summoning rare inhabitants and temporary helpers with high fear and adjacency bonuses",
  "userStories": [
    {
      "id": "US-001",
      "title": "Summoning Circle Room Definition",
      "description": "As a developer, I want the Summoning Circle defined in YAML gamedata so that it is available through the content pipeline",
      "acceptanceCriteria": [
        "A summoning-circle.yaml file exists in the appropriate gamedata/ directory",
        "Fields include: id, name, description, shape (L-shaped), maxInhabitants, baseFearLevel, summonRecipes, upgradePaths, adjacencyBonuses",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Summoning Circle added to gamedata/room/base.yml with L-shape, fearLevel 3, maxInhabitants 1, role summoningCircle, 3 upgrade paths. New summonrecipe content type in gamedata/summonrecipe/base.yml."
    },
    {
      "id": "US-002",
      "title": "L-Shaped Room Placement",
      "description": "As a dungeon builder, I want to place the Summoning Circle as an L-shaped room on the grid",
      "acceptanceCriteria": [
        "The Summoning Circle occupies an L-shaped set of tiles",
        "The room can be rotated (4 orientations) during placement",
        "Placement validates that all L-shaped tiles are unoccupied",
        "Renders correctly on the grid in all orientations",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Uses existing L-shape 82f509dd-9ff8-4c99-986d-0b57198a4749 (3x3, 5 tiles). Room placement and rotation handled by existing room-placement system."
    },
    {
      "id": "US-003",
      "title": "Summon Rare Inhabitants",
      "description": "As a dungeon builder, I want to use the Summoning Circle to summon rare inhabitants not available through normal recruitment",
      "acceptanceCriteria": [
        "At least 3 rare inhabitant types are summonable (e.g. Demon, Elemental, Shadow Beast)",
        "Each summon has a defined resource cost (Essence, Crystals, etc.)",
        "Summoning takes a defined amount of time to complete",
        "The summoned inhabitant is added to the player's roster upon completion",
        "Summoning requires at least 1 inhabitant assigned as a summoner",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "3 permanent summon recipes (Fire Elemental, Shadow Beast, Frost Wraith) with restrictionTags:[summoned] preventing normal recruitment. Tick-based summoning via summoningCircleProcess()."
    },
    {
      "id": "US-004",
      "title": "Summon Temporary Helpers",
      "description": "As a dungeon builder, I want to summon temporary helpers that assist for a limited time",
      "acceptanceCriteria": [
        "At least 2 temporary helper types are summonable",
        "Temporary helpers have a defined duration (e.g. 10 minutes)",
        "Helpers automatically despawn when their duration expires",
        "A timer shows remaining duration for each active helper",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "2 temporary recipes (Spectral Servant, Arcane Familiar) with duration 50 ticks. Auto-despawn via temporaryTicksRemaining countdown in summoningCircleProcess(). UI shows ticks remaining."
    },
    {
      "id": "US-005",
      "title": "Summoning Interface",
      "description": "As a dungeon builder, I want a summoning menu that shows available summons, costs, and cooldowns",
      "acceptanceCriteria": [
        "The room panel shows a list of available summon options",
        "Each option displays: creature name, resource cost, summoning time, description",
        "Unavailable summons (insufficient resources) are grayed out with cost breakdown",
        "Active summoning shows a progress indicator",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "PanelSummoningCircleComponent shows recipe list with costs, stat bonuses, time estimate, progress bar for active job, and disabled state for unaffordable recipes."
    },
    {
      "id": "US-006",
      "title": "High Fear Level and Capacity",
      "description": "As a developer, I want the Summoning Circle to have high fear and limited capacity reflecting its dark ritual nature",
      "acceptanceCriteria": [
        "Base fear level is High (3)",
        "Base capacity is 1 inhabitant (the summoner)",
        "Fear level integrates with the fear tracking and propagation systems",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "fearLevel: 3 and maxInhabitants: 1 set in gamedata/room/base.yml. Integrates with existing fear-level.ts system."
    },
    {
      "id": "US-007",
      "title": "Upgrade Paths",
      "description": "As a dungeon builder, I want three mutually exclusive upgrade paths for the Summoning Circle",
      "acceptanceCriteria": [
        "Greater Summoning: unlocks 2+ advanced summon recipes with higher costs and stronger stats",
        "Dual Circle: increases max inhabitants from 1 to 2, allowing parallel summons",
        "Binding Mastery: temporary helpers last 50% longer and permanent summons gain +1 to all stats",
        "Each upgrade has a defined resource cost",
        "Choosing one path locks out alternatives at this tier",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "3 upgrades: Greater Summoning (summonTierUnlock), Dual Circle (maxInhabitantBonus: 1), Binding Mastery (summonDurationMultiplier: 1.5 + summonStatBonus: 1). All in same tier for mutual exclusion."
    },
    {
      "id": "US-008",
      "title": "Adjacency Bonuses",
      "description": "As a dungeon builder, I want the Summoning Circle to receive adjacency bonuses from specific room types",
      "acceptanceCriteria": [
        "Summoning Circle + Library adjacency: -25% summoning time",
        "Summoning Circle + Soul Well adjacency: summoned creatures gain +2 HP",
        "Bonuses are defined in gamedata and activate via the adjacency bonus system",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "summoningAdjacencyEffects added to Shadow Library (summonTimeReduction: 0.25) and Soul Well (summonStatBonus: 2) in gamedata/room/base.yml. Data-driven adjacency pattern."
    }
  ]
}
