{
  "project": "Blunderdark",
  "branchName": "ralph/particle-effects",
  "description": "Particle Effects - A lightweight particle system with magic sparkles, corruption tendrils, resource generation particles, combat impacts, and biome-specific ambient effects rendered via CSS animations or Canvas overlays.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create ParticleService and particle renderer component",
      "description": "As a developer, I want a ParticleService and renderer component so that any part of the app can trigger particle effects.",
      "acceptanceCriteria": [
        "ParticleService singleton (providedIn: 'root') with methods to spawn, update, and destroy emitters",
        "Each emitter configurable: position, particle count, lifetime, velocity, color, size, opacity fade",
        "Emitters auto-cleanup after particles expire",
        "Service uses requestAnimationFrame for updates (not game loop tick)",
        "ParticleRendererComponent (standalone, OnPush) renders particles using CSS transforms and opacity",
        "Component accepts emitter configuration via input()",
        "Particles animate smoothly at 60fps; DOM elements cleaned up on expiry",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement magic sparkle and corruption tendril effect presets",
      "description": "As a player, I want to see sparkle effects for Flux generation and dark tendrils for corruption so that magical and dark activity is visually communicated.",
      "acceptanceCriteria": [
        "Sparkle preset: small bright particles, random upward drift, fade-out, blue/purple palette, 5-15 particles per burst",
        "Sparkle triggers on Flux resource generation and magic room actions",
        "Corruption preset: dark slow-moving particles that drift and fade, dark purple/black with low opacity",
        "Corruption emitter is continuous on corrupted rooms while visible, activates/deactivates based on visibility",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement resource generation and combat impact particles",
      "description": "As a player, I want visual feedback when rooms produce resources and during combat so that production and battles feel dynamic.",
      "acceptanceCriteria": [
        "Resource preset: small colored dots floating upward, different color per resource type (gold for coins, green for food, blue for Flux)",
        "Resource particles trigger on room production ticks, 0.5-1 second lifetime",
        "Combat hit preset: bright fast-expanding particles that fade quickly",
        "Combat miss preset: subtle whiff/puff effect",
        "Death/defeat preset: dramatic particle burst",
        "Combat particles do not obscure HP or damage numbers",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement biome ambient particles and particle toggle option",
      "description": "As a player, I want biome-specific ambient particles and the ability to toggle all particles off for performance.",
      "acceptanceCriteria": [
        "Volcanic biome: orange/red floating embers with upward drift",
        "Flooded biome: blue water droplets/bubbles with downward or lateral drift",
        "Crystalline biome: white/cyan shimmer/glint with stationary twinkle",
        "Fungal biome: green/yellow floating spores with slow random drift",
        "Ambient particles are continuous low-density emitters, only active when biome is visible",
        "GameOptions includes showParticles boolean (default true), persisted via localStorageSignal",
        "When disabled, no particle emitters are spawned",
        "Toggle in UI tab of options panel",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
