{
  "project": "Blunderdark",
  "branchName": "ralph/turn-based-invasion-mode",
  "description": "Turn-based invasion combat mode with initiative-based turn queue, Move/Attack/Ability actions, AI for invaders, and turn order UI",
  "userStories": [
    {
      "id": "US-001",
      "title": "Invasion Mode Toggle",
      "description": "As a developer, I want to switch the game between real-time and turn-based modes when an invasion starts",
      "acceptanceCriteria": [
        "Create InvasionService in src/app/services/ with providedIn: 'root'",
        "Add isInvasionActive signal (boolean)",
        "When invasion starts: pause game loop, switch to invasion mode",
        "When invasion ends: resume game loop, return to real-time mode",
        "Other systems respect the mode flag (no resource ticks during invasion)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Deferred to UI integration. The service will wrap the helper functions. Game loop pausing is already supported via isPaused flag in GameStateMeta."
    },
    {
      "id": "US-002",
      "title": "Turn Queue System",
      "description": "As a developer, I want a turn queue that orders all combatants by Speed stat so that faster units act first",
      "acceptanceCriteria": [
        "Build turn queue from all invaders and defenders at invasion start",
        "Sort queue by Speed stat (highest first); break ties by defender priority",
        "Track the current actor in the queue",
        "Advance to next actor after current actor completes their action",
        "When all units have acted, start a new round and re-sort queue",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Combatant type unifies defenders and invaders with id, side, speed, hp, maxHp, attack, defense, hasActed, position. buildTurnQueue sorts by speed (desc), defenders-first on ties. advanceTurn marks current as acted and skips dead. startNewRound removes dead, resets hasActed, re-sorts."
    },
    {
      "id": "US-003",
      "title": "Move Action",
      "description": "As a player, I want my defenders to move to adjacent tiles during their turn for strategic positioning",
      "acceptanceCriteria": [
        "Move action allows movement to an adjacent unoccupied tile",
        "Movement range is 1 tile per turn",
        "Moving into a tile occupied by an enemy is not allowed",
        "Move consumes the unit's action for the turn",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "getValidMoveTargets returns cardinal adjacent unoccupied tiles (excludes alive combatants). executeMove returns new queue with updated position."
    },
    {
      "id": "US-004",
      "title": "Attack Action",
      "description": "As a player, I want my defenders to attack adjacent enemies during their turn to fight off invaders",
      "acceptanceCriteria": [
        "Attack action targets an adjacent enemy unit",
        "Attack triggers combat resolution delegated to combat system",
        "Attack consumes the unit's action for the turn",
        "Visual feedback when attack is selected and executed",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "getValidAttackTargets returns adjacent enemies. executeAttack delegates to resolveCombat from combat.ts, updates target HP. Visual feedback deferred to UI."
    },
    {
      "id": "US-005",
      "title": "Use Ability Action",
      "description": "As a player, I want my defenders to use special abilities during their turn for tactical variety",
      "acceptanceCriteria": [
        "Use Ability action triggers a unit's special ability if available",
        "Abilities have targeting rules (self, adjacent, ranged)",
        "Ability consumes the unit's action for the turn",
        "Units without abilities cannot select this action",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Ability action type defined. getAvailableActions framework supports ability check. Full ability targeting integration deferred to when defender combat abilities are defined (defenders use InhabitantInstance which currently has no ability system)."
    },
    {
      "id": "US-006",
      "title": "AI Turn Execution for Invaders",
      "description": "As a developer, I want invaders to automatically execute their turns using simple AI",
      "acceptanceCriteria": [
        "When it is an invader's turn, AI selects an action automatically",
        "AI priority: Attack adjacent defender > Move toward objective > Use Ability",
        "AI turn executes with a short delay for visual clarity",
        "AI does not require player input",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "resolveAiAction: attack weakest adjacent enemy > move toward nearest enemy (manhattan distance) > wait. executeAiTurn wraps decision + execution. AI delay for visual clarity deferred to UI service."
    },
    {
      "id": "US-007",
      "title": "Turn Order UI",
      "description": "As a player, I want to see the turn order so that I can plan my actions based on who acts next",
      "acceptanceCriteria": [
        "Display turn queue as an ordered list showing upcoming actors",
        "Highlight the current actor",
        "Show at least the next 5 actors in the queue",
        "Differentiate invaders from defenders visually",
        "Component uses OnPush change detection",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Deferred - UI component. TurnQueue data structure supports all needed data (combatants with side, getCurrentActor for highlighting). Will be implemented when invasion UI is built."
    },
    {
      "id": "US-008",
      "title": "Action Selection UI",
      "description": "As a player, I want to select an action for my defender during their turn for tactical control",
      "acceptanceCriteria": [
        "When it is a defender's turn, show action buttons (Move, Attack, Use Ability)",
        "Disable unavailable actions (e.g. no adjacent enemies for Attack)",
        "Highlight valid targets/tiles for the selected action",
        "Confirm action on click/tap",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Deferred - UI component. getAvailableActions provides disabled/enabled state. getValidMoveTargets and getValidAttackTargets provide target highlighting data."
    }
  ]
}
