{
  "project": "Blunderdark",
  "branchName": "ralph/invasion-trigger-system",
  "description": "Invasion Trigger System - Controls when invasions occur: 30-day grace period, escalating frequency schedule, random variance, 2-minute pre-invasion warnings, special event triggers, and persistent scheduling.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement invasion scheduling with grace period and escalating frequency",
      "description": "As a developer, I want an invasion scheduler with a grace period and increasing frequency so that invasions escalate over time.",
      "acceptanceCriteria": [
        "Create InvasionTriggerService in src/app/services/ with providedIn: 'root'",
        "No invasions before day 30 (grace period configurable in game settings)",
        "Base interval: 15 days at day 30, 10 days at day 60, 7 days at day 100, minimum 5 days",
        "Each scheduled invasion has random variance of +/- 2 days (determined at scheduling, not re-rolled)",
        "Variance cannot push invasion before grace period; minimum 3 days between consecutive invasions",
        "Schedule recalculated when an invasion completes",
        "Grace period status visible to the player",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Implemented as helper functions in invasion-triggers.ts (following project convention of helpers over services). Grace period exposed via isInGracePeriodSignal computed signal."
    },
    {
      "id": "US-002",
      "title": "Implement invasion warnings and special triggers",
      "description": "As a developer, I want pre-invasion warnings and support for special event-triggered invasions.",
      "acceptanceCriteria": [
        "Warning notification displayed 2 game minutes before invasion starts",
        "Warning text: 'Invasion approaching!' - dismissible but remains visible",
        "triggerSpecialInvasion(type, delay?) method on InvasionTriggerService",
        "Special invasions bypass normal schedule with their own warning period",
        "Special invasion types: 'crusade' | 'raid' | 'bounty_hunter'",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Warning fires via notify() 2 minutes before invasion. addSpecialInvasion() is the pure function equivalent of triggerSpecialInvasion. Browser verification deferred (no UI panel yet for invasion display)."
    },
    {
      "id": "US-003",
      "title": "Implement invasion schedule persistence",
      "description": "As a developer, I want invasion schedule data to persist so that save/load does not reset the timeline.",
      "acceptanceCriteria": [
        "Persist next scheduled invasion day, variance, and invasion history to IndexedDB",
        "Restore schedule on game load",
        "Handle edge case: loaded game is past scheduled invasion day (trigger immediately after load)",
        "Use Angular Signals for next invasion day and warning state",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "InvasionSchedule stored in GameStateWorld (auto-persisted via IndexedDB). Past-due invasions trigger on first tick after load. Computed signals: nextInvasionDay, invasionWarningActive, isInGracePeriodSignal, invasionGracePeriodEnd, invasionHistory."
    }
  ]
}
