{
  "project": "Blunderdark",
  "branchName": "ralph/functional-features",
  "description": "Functional Features - Six utility-focused room attachments (Storage Expansion, Efficiency Enchantment, Fear Ward, Corruption Seal, Training Station, Resource Converter) providing practical bonuses to room operations.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define all functional features in YAML gamedata",
      "description": "As a developer, I want all six functional features defined in YAML so that they integrate with the content pipeline.",
      "acceptanceCriteria": [
        "All six functional features defined in gamedata/feature/ YAML files",
        "Each definition includes: id (UUID), name, description, category ('functional'), cost, bonuses",
        "Storage Expansion: +100% resource storage capacity",
        "Efficiency Enchantment: +20% base production",
        "Fear Ward: -2 Fear in room",
        "Corruption Seal: prevent Corruption generation",
        "Training Station: passive XP gain for inhabitants",
        "Resource Converter: toggle output type at 75% efficiency",
        "The build pipeline compiles and validates all definitions via npm run gamedata:build",
        "ContentService serves functional features queryable by category",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement Storage Expansion, Efficiency Enchantment, and Fear Ward bonus logic",
      "description": "As a player, I want Storage Expansion, Efficiency Enchantment, and Fear Ward to apply their bonuses when attached to rooms.",
      "acceptanceCriteria": [
        "Storage Expansion doubles the room's maximum resource storage capacity for all resource types",
        "Removing Storage Expansion reduces capacity; excess resources are capped but not lost",
        "Efficiency Enchantment increases room production by 20% multiplicatively with other modifiers",
        "Fear Ward decreases room Fear value by 2, clamped at minimum 0",
        "All bonuses are reverted when features are removed",
        "Unit tests verify storage doubling, production increase, Fear reduction, and removal behavior",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement Corruption Seal and Training Station bonus logic",
      "description": "As a player, I want Corruption Seal to stop Corruption generation and Training Station to grant XP to inhabitants.",
      "acceptanceCriteria": [
        "Corruption Seal zeroes Corruption generation in the room regardless of other modifiers",
        "Existing Corruption is not removed, only new generation is prevented",
        "Training Station grants XP to all inhabitants assigned to the room each game tick",
        "XP gain rate is defined in gamedata and scales with game tick rate",
        "Bonuses are reverted when features are removed",
        "Unit tests verify Corruption zeroing and XP accumulation over time",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement Resource Converter toggle UI and logic",
      "description": "As a player, I want the Resource Converter to let me toggle a room's output to a different resource type at 75% efficiency.",
      "acceptanceCriteria": [
        "When attached, a dropdown or toggle appears in the room panel to select output resource",
        "Available output resources are defined per room type in gamedata",
        "Conversion applies 75% efficiency rate (25% production loss)",
        "Switching output type takes effect immediately",
        "Unit tests verify conversion rate and output switching",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    }
  ]
}
