{
  "project": "Blunderdark",
  "branchName": "ralph/hallway-placement-tool",
  "description": "Hallway Placement Tool - UI workflow for building hallways between non-adjacent rooms with source/destination selection, real-time path preview, cost display (5 Crystals/tile), and confirm/cancel flow.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement hallway build mode entry and exit",
      "description": "As a dungeon builder, I want to activate and deactivate a hallway build mode so that I can start and cancel the hallway construction workflow.",
      "acceptanceCriteria": [
        "A 'Build Hallway' button exists in the build toolbar",
        "Clicking it enters hallway build mode, changing cursor/UI state",
        "Other build actions are disabled while in hallway mode",
        "Pressing Escape or clicking Cancel exits hallway mode and cleans up all preview state",
        "Cancel button is visible throughout the build process",
        "No resources are deducted on cancel",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "hallway-placement.ts with HallwayBuildStep signal. Build Hallway button in panel-room-select toggles mode. Escape/right-click/Cancel all exit. Room buttons disabled in hallway mode. Crosshair cursor on grid. Dev server not running so browser verification skipped."
    },
    {
      "id": "US-002",
      "title": "Implement source and destination room selection with path preview",
      "description": "As a dungeon builder, I want to select source and destination rooms and see a path preview so that I can plan my hallway.",
      "acceptanceCriteria": [
        "In hallway build mode, clicking a room highlights it as the source with a visual indicator",
        "A prompt says 'Now select the destination room'",
        "Clicking a second room triggers pathfinding and renders the calculated path as a highlighted overlay on the grid",
        "Total tile count and cost (5 Crystals x tiles) are displayed",
        "If no valid path exists, message says 'No valid path found'",
        "Preview updates if the player selects a different destination",
        "Clicking an empty tile does nothing (only rooms are valid sources/destinations)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "BFS pathfinding through empty grid tiles. Source room highlighted with outline, path shown as teal overlay. Status messages and cost (tile count × 5 Crystals) displayed in panel. handleHallwayTileClick manages selectSource → selectDestination → preview flow. 8 unit tests for findHallwayPath. Dev server not running so browser verification skipped."
    },
    {
      "id": "US-003",
      "title": "Implement hallway build confirmation with resource validation",
      "description": "As a dungeon builder, I want to confirm the hallway build to place it and deduct resources, with feedback when I cannot afford it.",
      "acceptanceCriteria": [
        "A 'Confirm' button appears alongside the path preview",
        "Clicking Confirm deducts the Crystal cost and places the hallway",
        "Hallway tiles are marked as occupied on the grid",
        "Hallway data structure is created and added to game state",
        "UI exits hallway build mode after confirmation",
        "If Crystal count is less than cost, cost text turns red and Confirm button is disabled with tooltip 'Insufficient Crystals'",
        "Path preview still shows when resources are insufficient so player knows the cost needed",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "confirmHallwayBuild() in hallway-placement.ts handles full flow: validates path exists, pays crystal cost via payCost(), creates Hallway object, updates floor grid and hallways array via updateGamestate(), exits build mode. canAffordHallway computed signal drives UI: Confirm button disabled when insufficient crystals, cost text turns red. Panel-room-select template shows Confirm button during preview step with tooltip 'Insufficient Crystals' when disabled."
    }
  ]
}
