{
  "project": "Blunderdark",
  "branchName": "ralph/inhabitant-recruitment-system",
  "description": "Inhabitant Recruitment System - Allows players to spend resources to recruit inhabitants from an altar interface, with tier-based availability, cost display, and roster limits.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create recruitment UI panel with inhabitant display",
      "description": "As a player, I want a recruitment interface showing available inhabitants with their stats and costs so that I can make informed recruitment choices.",
      "acceptanceCriteria": [
        "Recruitment panel opens when clicking the altar room on the grid",
        "Panel shows list of available inhabitant types with: name, tier badge, description, key stats (HP, Attack, Defense, Speed, Efficiency)",
        "Traits displayed as tags with tooltip descriptions",
        "Resource cost shown for each type (e.g., 'Cost: 50 Gold, 20 Crystals')",
        "Inhabitants the player cannot afford have dimmed costs with insufficient resource highlighted in red",
        "Panel has title, close button, and closes with Escape",
        "Component is standalone with OnPush change detection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement purchase transaction and inhabitant creation",
      "description": "As a player, I want to click Recruit to purchase an inhabitant that joins my roster with resources deducted.",
      "acceptanceCriteria": [
        "A 'Recruit' button shown for each inhabitant type, disabled when player cannot afford",
        "Clicking 'Recruit' atomically deducts resource cost using payCost() from resource manager",
        "A new InhabitantInstance created with unique ID (crypto.randomUUID()), definitionId, state 'normal', assignedRoomId null",
        "New inhabitant added to GameStateWorld.inhabitants",
        "Success notification shown: 'Recruited [Name]!'",
        "Disabled button shows tooltip listing missing resources: 'Need: 30 more Gold, 10 more Crystals'",
        "Button state updates reactively when resources change",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement tier-based availability and roster limits",
      "description": "As a developer, I want recruitment gated by tier and a maximum roster size so that progression and balance are maintained.",
      "acceptanceCriteria": [
        "Only inhabitants with tier <= unlockedTier() signal appear as recruitable",
        "Tier 1 always unlocked (Goblin, Kobold, Skeleton, Myconid, Slime)",
        "Higher tiers shown as locked with message 'Requires Tier X' for discoverability",
        "Configurable maximum total inhabitants limit (e.g., 50 max)",
        "When at max, Recruit button disabled for all types with 'Roster full' message",
        "Current count and max displayed in panel header (e.g., 'Inhabitants: 12/50')",
        "Max can be increased by specific rooms or upgrades (data-driven)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ]
}
