{
  "project": "Blunderdark",
  "branchName": "ralph/invasion-win-loss-conditions",
  "description": "Invasion Win/Loss Conditions - Clear victory and defeat conditions: defenders win by eliminating/routing all invaders, invaders win by destroying the Altar or completing 2 secondary objectives, with a 30-turn limit and results screen.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Implement win/loss condition checks and turn limit",
      "description": "As a developer, I want clear victory and defeat conditions checked after each action so that invasions resolve correctly.",
      "acceptanceCriteria": [
        "Defender victory: all invaders dead or retreated (fled off map)",
        "Invader victory: Altar destroyed (HP reaches 0) - Altar has 100 HP and can be attacked by adjacent invaders",
        "Invader victory: 2 secondary objectives completed (Vault steal, Throne defile - completed by occupying for 2 consecutive turns)",
        "30-turn maximum: defenders win by default when limit reached",
        "Win/loss check runs after every action, not just end of turn",
        "Victory/defeat triggers invasion end and transitions to results screen",
        "Track objective completion status and turn counter during invasion",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "InvasionState type tracks active invasion. checkInvasionEnd() checks 4 conditions with priority: altar_destroyed > objectives_completed > all_invaders_eliminated > turn_limit_reached. Pure state mutation functions: damageAltar, advanceInvasionTurn, markInvaderKilled, recordDefenderLoss, endInvasion. 55 tests."
    },
    {
      "id": "US-002",
      "title": "Create invasion results screen",
      "description": "As a player, I want a summary after each invasion showing what happened.",
      "acceptanceCriteria": [
        "Results screen displayed at invasion end showing: Win/Loss, turns taken, invaders killed, defenders lost",
        "Shows resources looted by invaders if secondary objectives completed",
        "Shows rewards earned by defenders (experience, resources)",
        "Current turn number and remaining turns displayed in UI during invasion",
        "'Continue' button returns to normal gameplay",
        "Component uses OnPush change detection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Deferred - no invasion UI/mode exists yet. Results screen will be implemented with turn-based-invasion-mode (9.8)."
    },
    {
      "id": "US-003",
      "title": "Implement invasion history tracking and persistence",
      "description": "As a developer, I want invasion history persisted so that past invasions can inform difficulty scaling.",
      "acceptanceCriteria": [
        "Each invasion result stored: day, outcome, invader count, defender count, turns taken",
        "Invasion history persisted to IndexedDB",
        "invasionHistory signal exposed for other systems to consume",
        "Types defined in src/app/interfaces/ using type keyword",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "DetailedInvasionResult type captures full result. createHistoryEntry() produces persistable history records. History persistence uses existing InvasionSchedule.invasionHistory via invasion-triggers system. invasionHistory signal already exposed from invasion-triggers.ts."
    }
  ]
}
