{
  "project": "Blunderdark",
  "branchName": "ralph/throne-room",
  "description": "Throne Room - a unique 4x4 room housing a single powerful ruler creature that provides dungeon-wide bonuses based on the seated ruler",
  "userStories": [
    {
      "id": "US-001",
      "title": "Throne Room YAML Definition",
      "description": "As a developer, I want the Throne Room defined in YAML gamedata with the unique constraint",
      "acceptanceCriteria": [
        "A throne-room.yaml file exists in gamedata/rooms/",
        "Fields include: id, name, description, shape (4x4 square), maxInhabitants (1), isUnique (true)",
        "Inhabitant restriction: only creatures tagged as Unique tier can be assigned",
        "Fear level field is set to variable (derived from ruler)",
        "npm run gamedata:build compiles without errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Updated existing Throne Room in gamedata/room/base.yml with 4x4 shape (Square 4x4), isUnique: true, maxInhabitants: 1, inhabitantRestriction: unique, fearLevel: variable. Added new fields to RoomDefinition type and ensureRoom initializer with backward-compatible defaults. gamedata:build, typecheck, lint, and all 362 tests pass."
    },
    {
      "id": "US-002",
      "title": "Unique Room Enforcement",
      "description": "As a developer, I want only one Throne Room per dungeon so that it feels special",
      "acceptanceCriteria": [
        "The room placement system checks for existing Throne Rooms before allowing placement",
        "If a Throne Room already exists, the build option is grayed out with an explanatory tooltip",
        "The uniqueness check is enforced at the data level, not just UI",
        "Unit test verifies placement is rejected when a Throne Room already exists",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "isUniqueRoomTypePlaced() pure function checks all floors for existing room type. executeRoomPlacement() rejects placement if roomDef.isUnique and already placed. placedRoomTypeIds computed signal drives UI reactivity. panel-room-select disables button with 'Already built (unique room)' tooltip. 5 unit tests covering empty/placed/cross-floor/different-type scenarios. All 367 tests pass."
    },
    {
      "id": "US-003",
      "title": "Unique Creature Restriction",
      "description": "As a player, I want only Unique creatures assignable to the Throne so that the ruler is always exceptional",
      "acceptanceCriteria": [
        "The inhabitant assignment UI only shows Unique-tier creatures for the Throne Room",
        "Non-Unique creatures cannot be assigned even programmatically",
        "If the current ruler is removed, the Throne Room provides no bonuses",
        "An empty Throne Room displays a No Ruler state",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added restrictionTags: string[] to InhabitantDefinition type and ensureInhabitant() default. Pure validation functions: meetsInhabitantRestriction() checks tag membership, canAssignInhabitantToRoom() validates restriction + capacity, getEligibleInhabitants() filters definitions. assignInhabitantToRoom() enforces restrictions at data level before updating state. unassignInhabitantFromRoom() clears assignedRoomId (production system already returns 0 bonus for empty rooms). 15 unit tests covering restriction matching, capacity limits, and filtering. All 382 tests pass."
    },
    {
      "id": "US-004",
      "title": "Dungeon-Wide Ruler Bonuses",
      "description": "As a developer, I want ruler-specific dungeon-wide bonuses applied when a creature sits on the throne",
      "acceptanceCriteria": [
        "Dragon ruler grants: +10% Attack to all defenders, +5% Fear in all rooms",
        "Lich ruler grants: +20% research speed, +15% Flux production",
        "Demon Lord ruler grants: +25% corruption generation, +10% Fear, -10% invader morale",
        "Bonuses are applied as computed modifiers to relevant signals",
        "Bonuses are removed when ruler is unassigned",
        "Unit tests verify each ruler's bonus application and removal",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Added rulerBonuses: Record<string, number> to InhabitantDefinition. Created 3 unique ruler creatures in YAML: Dragon (attack: +10%, fear: +5%), Lich (researchSpeed: +20%, fluxProduction: +15%), Demon Lord (corruptionGeneration: +25%, fear: +10%, invaderMorale: -10%). New throne-room.ts helper with findThroneRoom(), getSeatedRulerInstance(), getActiveRulerBonuses(), getRulerBonusValue() pure functions and computed signals (seatedRuler, activeRulerBonuses). 16 unit tests verify each ruler's bonuses and removal. All 398 tests pass."
    },
    {
      "id": "US-005",
      "title": "Variable Fear Level",
      "description": "As a developer, I want the Throne Room's fear level to depend on the seated ruler",
      "acceptanceCriteria": [
        "Empty Throne Room: fear level 1 (low)",
        "Dragon ruler: fear level 4, Lich ruler: fear level 3, Demon Lord ruler: fear level 5",
        "Fear level is a computed() signal derived from the current ruler",
        "Fear integrates with the fear propagation system",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Added rulerFearLevel: number to InhabitantDefinition with YAML values: Dragon=4, Lich=3, Demon Lord=5. getThroneRoomFearLevel(floors) returns null if no throne, EMPTY_THRONE_FEAR_LEVEL (1) if empty, or ruler's value. throneRoomFearLevel computed signal for reactive UI/system consumption. Fear propagation system integration ready when that system is built (Phase 11). 7 unit tests. All 405 tests pass."
    },
    {
      "id": "US-006",
      "title": "Adjacency Bonuses",
      "description": "As a developer, I want the Throne Room to benefit from Vault adjacency and central placement",
      "acceptanceCriteria": [
        "When adjacent to a Vault, grants additional +5% gold production dungeon-wide",
        "Central placement (within 5 tiles of floor center) grants +10% to all ruler bonuses",
        "Bonuses are recalculated when rooms are added or removed",
        "Unit tests verify adjacency and centrality bonuses",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Throne Room UI",
      "description": "As a player, I want the Throne Room to have a distinct UI showing the current ruler and bonuses",
      "acceptanceCriteria": [
        "Clicking the Throne Room shows: current ruler (or Empty), active bonuses, fear level",
        "Ruler portrait/sprite is displayed prominently",
        "Dungeon-wide bonuses are listed with their values",
        "An Assign Ruler button allows selecting from eligible Unique creatures",
        "Component uses OnPush change detection",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
