{
  "project": "Blunderdark",
  "branchName": "ralph/conditional-state-modifiers",
  "description": "Conditional State Modifiers - Per-creature effects for scared, hungry, and normal states affecting production and food consumption.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define state modifier data in gamedata",
      "description": "As a developer, I want per-creature state modifiers defined in gamedata so that effects are data-driven.",
      "acceptanceCriteria": [
        "Each creature type defines stateModifiers with entries for scared, hungry, and normal",
        "Each state entry specifies: productionMultiplier, foodConsumptionMultiplier, optional special effects",
        "Example: Kobold scared = { productionMultiplier: 1.1, foodConsumptionMultiplier: 2.0 }",
        "YAML compiles correctly via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "All 8 creatures have fearTolerance and stateModifiers in base.yml. StateModifier type added to inhabitant.ts with productionMultiplier, foodConsumptionMultiplier, optional attackMultiplier and defenseMultiplier. YAML compiles successfully."
    },
    {
      "id": "US-002",
      "title": "Implement scared state detection",
      "description": "As the system, I want to determine if an inhabitant is scared based on fear tolerance and room fear level.",
      "acceptanceCriteria": [
        "Each inhabitant type defines a fearTolerance threshold (integer 0-4)",
        "An inhabitant is scared when the room's effective fear level exceeds their tolerance",
        "Scared state tracked per inhabitant as a derived value",
        "State updates when room fear or inhabitant assignment changes",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "isInhabitantScared(inhabitant, roomFearLevel) checks fearTolerance vs room fear. getFearTolerance(definitionId) with DEFAULT_FEAR_TOLERANCE=2 fallback. State update wiring deferred to fear-level-tracking system (Phase 11)."
    },
    {
      "id": "US-003",
      "title": "Apply scared modifiers to production and food consumption",
      "description": "As the system, I want scared modifiers to affect production and food consumption per creature type.",
      "acceptanceCriteria": [
        "When scared, creature type's scared.productionMultiplier is applied to production pipeline",
        "Scared inhabitants use scared.foodConsumptionMultiplier for food rate",
        "Positive multipliers (>1.0) increase; negative (<1.0) decrease",
        "Modifiers removed when no longer scared",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "getProductionMultiplier and getFoodConsumptionMultiplier use per-creature state modifiers. calculatePerCreatureProductionModifier averages individual multipliers. Production pipeline updated: calculateConditionalModifiers now delegates to per-creature system."
    },
    {
      "id": "US-004",
      "title": "Apply hungry modifiers to production",
      "description": "As the system, I want hungry modifiers to affect production per creature type.",
      "acceptanceCriteria": [
        "When hungry, creature type's hungry.productionMultiplier is applied",
        "Different creatures respond differently (Goblin: -50%, Imp: -20%, etc.)",
        "Modifier removed when inhabitant returns to fed state",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Hungry modifiers per creature: Goblin -50%, Kobold -30%, Skeleton unchanged, Myconid -40%, Slime -20%. All flow through same getProductionMultiplier → calculatePerCreatureProductionModifier pipeline."
    },
    {
      "id": "US-005",
      "title": "Implement combat modifier foundation",
      "description": "As a developer, I want the state modifier system to support future combat modifiers.",
      "acceptanceCriteria": [
        "State modifier type includes optional combatModifier fields (attack multiplier, defense multiplier)",
        "Combat fields can be null/undefined when not yet implemented",
        "Type is extensible for future combat attributes",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "StateModifier has optional attackMultiplier and defenseMultiplier fields. getAttackMultiplier and getDefenseMultiplier helper functions return 1.0 when not defined. All 8 creatures have combat modifiers for scared state in YAML."
    },
    {
      "id": "US-006",
      "title": "Display active state modifiers in inhabitant panel",
      "description": "As a dungeon builder, I want to see which modifiers are active on each inhabitant.",
      "acceptanceCriteria": [
        "Inhabitant panel shows active state modifiers (e.g., 'Scared: +10% production, 2x food')",
        "Negative modifiers highlighted in red; positive in green",
        "Hovering shows full modifier details",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Deferred - UI component. getStateModifier provides all data needed for display. Will be implemented when inhabitant panel is built/updated."
    }
  ]
}
