{
  "project": "Blunderdark",
  "branchName": "ralph/hunger-system",
  "description": "Hunger System - Tracks food consumption per inhabitant, auto-deducts food from resources, manages hunger states (fed/hungry/starving) with production penalties, and supports the Inappetent trait.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define food consumption rates and hunger state types",
      "description": "As a developer, I want food consumption rates in gamedata and hunger state types so that the hunger system is data-driven and well-typed.",
      "acceptanceCriteria": [
        "Inhabitant type definitions in gamedata include a foodConsumptionRate field (food per game-hour)",
        "Different inhabitant types have different rates (e.g., Goblin: 2/hr, Skeleton: 0/hr)",
        "A HungerState type is defined: 'fed' | 'hungry' | 'starving'",
        "Inhabitants with the inappetent trait have a food consumption rate of 0",
        "Types use type keyword per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement automatic food deduction and hunger state transitions",
      "description": "As the system, I want food automatically deducted each tick and hunger states to transition based on food availability.",
      "acceptanceCriteria": [
        "Each game tick, food is deducted for all active inhabitants: total = sum of consumption rates * time elapsed",
        "Deduction uses ResourceManager to subtract from the Food pool; food does not go negative",
        "State transitions: fed -> hungry when food runs out for X ticks, hungry -> starving after Y more ticks",
        "Restoring food transitions: starving -> hungry -> fed",
        "Inappetent inhabitants never transition to hungry or starving; permanently 'fed'",
        "Each inhabitant's hunger state stored in game state and emits updates via Angular Signals",
        "Transition timing is configurable (not hardcoded)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Apply hunger production penalties",
      "description": "As the system, I want hungry and starving inhabitants to produce less so that feeding them matters strategically.",
      "acceptanceCriteria": [
        "Hungry inhabitants have a production multiplier of 0.5x",
        "Starving inhabitants have a production multiplier of 0.1x",
        "Fed inhabitants have no penalty (1.0x)",
        "Penalties integrate with the production modifier pipeline",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement food depletion warnings",
      "description": "As a dungeon builder, I want warnings when food is running low so that I can act before inhabitants starve.",
      "acceptanceCriteria": [
        "Warning notification appears when food drops below a threshold (e.g., 20% of consumption rate * 5 minutes)",
        "Warning appears once, not repeatedly, until condition changes",
        "Critical warning appears when food hits zero",
        "Warnings are visible in the notification system",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
