{
  "project": "Blunderdark",
  "branchName": "ralph/research-unlocks",
  "description": "Research unlock system that applies effects when research nodes complete, tracking unlocked rooms, inhabitants, abilities, upgrades, and passive bonuses",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Unlock Effect Types",
      "description": "As a developer, I want well-typed unlock effects so that each research node has a clear, implementable effect",
      "acceptanceCriteria": [
        "An UnlockEffect union type is defined with variants: RoomUnlock, InhabitantUnlock, AbilityUnlock, UpgradeUnlock, PassiveBonusUnlock",
        "Each variant includes the necessary ID or descriptor to apply the unlock",
        "Types use type keyword per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "UnlockEffect union type in interfaces/research.ts. 5 variants: RoomUnlock, InhabitantUnlock, AbilityUnlock, UpgradeUnlock, PassiveBonusUnlock. UnlockedContent type also added. ResearchState updated with unlockedContent field."
    },
    {
      "id": "US-002",
      "title": "Map Research Nodes to Unlock Effects",
      "description": "As a developer, I want each research node in the YAML data to specify its unlock effects",
      "acceptanceCriteria": [
        "Every research node has an unlocks array in its YAML definition",
        "Unlock effects reference valid game content IDs (room IDs, inhabitant IDs, etc.)",
        "Build-time validation checks that all referenced IDs exist in the gamedata",
        "npm run gamedata:build compiles without errors",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "All 38 research nodes across 4 YAML files (base, dark, arcane, engineering) have unlock effects. T1 nodes unlock rooms. Necromancy unlocks Skeleton inhabitant. Higher tiers use passive_bonus unlocks. Build-time validation added to gamedata-build.ts."
    },
    {
      "id": "US-003",
      "title": "Track Unlocked Content",
      "description": "As a developer, I want to track all unlocked content so that systems can query whether content is available",
      "acceptanceCriteria": [
        "An UnlockedContent type tracks unlocked rooms, inhabitants, abilities, and upgrades as arrays of IDs",
        "The unlocked content state is part of GameStateWorld for persistence",
        "A helper function isUnlocked(type, id) checks if specific content is unlocked",
        "Unit tests verify unlock tracking",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "research-unlocks.ts helper with query functions, apply effects, and completion handler. 32 tests in research-unlocks.spec.ts covering all unlock types and edge cases."
    },
    {
      "id": "US-004",
      "title": "Apply Unlock Effects on Completion",
      "description": "As a developer, I want unlock effects applied automatically when research completes so that new content becomes available",
      "acceptanceCriteria": [
        "When research completes, each unlock effect in the node's unlocks array is processed",
        "Room unlocks add the room to the player's available rooms list",
        "Inhabitant unlocks add the creature to the recruitment pool",
        "Passive bonuses are added to the global modifier system",
        "The unlock processor is called from the research completion handler",
        "Unit tests verify each unlock effect type is applied correctly",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "researchUnlockProcessCompletion() called synchronously from researchProcess() during game tick. Applies unlock effects in-place atomically. 2 integration tests in research-progress.spec.ts verify the wiring."
    },
    {
      "id": "US-005",
      "title": "Content Gating by Research",
      "description": "As a player, I want content to be gated behind research so that I must progress the tech tree to access advanced features",
      "acceptanceCriteria": [
        "Room placement UI only shows rooms that are unlocked or always-available base rooms",
        "Inhabitant recruitment only shows creatures that are unlocked",
        "Locked content is shown as greyed-out with Requires: [Research Name] label",
        "The gating check uses the isUnlocked() helper",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Room panel: isResearchLocked() disables and greys out gated rooms, shows 'Requires: X' label instead of cost. Altar panel: researchLocked/researchRequirement fields added to RecruitableEntry, shows 'Requires: X' for locked inhabitants."
    },
    {
      "id": "US-006",
      "title": "Unlock Notification UI",
      "description": "As a player, I want to be notified when new content is unlocked so that I know what became available",
      "acceptanceCriteria": [
        "When research completes, a notification/toast appears listing the unlocked content",
        "Each unlocked item shows its name, icon, and a brief description",
        "The notification can be dismissed by clicking or after a timeout",
        "A New badge appears on unlocked content in room/creature menus until viewed",
        "The notification component is standalone with OnPush change detection",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Toast notification via NotifyService subscribing to researchUnlock$. Shows 'Research Complete: [Name]' title with list of unlocked content (rooms, creatures, passive bonuses). Uses existing ngx-toastr pattern."
    }
  ]
}
