{
  "project": "Blunderdark",
  "branchName": "ralph/hallway-data-structure",
  "description": "Hallway Data Structure - Defines how hallways are represented, stored, and managed in game state, with typed data structures, grid tile occupancy, upgrade storage, and serialization for save/load.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Hallway and HallwayUpgrade types",
      "description": "As a developer, I want TypeScript types for hallways so that all hallway data is consistently structured across the codebase.",
      "acceptanceCriteria": [
        "A Hallway type defined in src/app/interfaces/ with fields: id: string, startRoomId: string, endRoomId: string, tiles: Tile[], upgrades: HallwayUpgrade[]",
        "A HallwayUpgrade type defined with at minimum id and name fields",
        "Types use type keyword (not interface) per project conventions",
        "Types exported from the interfaces barrel (index.ts) at @interfaces",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Hallway and HallwayUpgrade types in src/app/interfaces/hallway.ts, uses TileOffset from room-shape.ts"
    },
    {
      "id": "US-002",
      "title": "Implement hallway tile occupancy on the grid",
      "description": "As a developer, I want hallway tiles marked as occupied on the grid so that rooms and other hallways cannot overlap them.",
      "acceptanceCriteria": [
        "When a hallway is created, each tile in its path is marked as occupied in the grid",
        "Tile occupancy distinguishes between 'room', 'hallway', and 'empty' using an enum or union type",
        "When a hallway is removed, its tiles are freed on the grid",
        "Other placement systems treat hallway tiles as impassable",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "TileOccupant union type added to GridTile; addHallwayToGrid/removeHallwayFromGrid/isTileBlockedForHallway in hallways.ts"
    },
    {
      "id": "US-003",
      "title": "Add hallway collection to game state with persistence",
      "description": "As a developer, I want hallways stored in game state so that they persist across sessions and can be queried.",
      "acceptanceCriteria": [
        "GameState type includes a hallways array",
        "Hallways saved to and loaded from IndexedDB",
        "Adding/removing hallways updates the game state signal reactively",
        "A helper function getHallwaysBetween(roomAId, roomBId): Hallway[] exists",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "hallways: Hallway[] added to GameStateWorld; getHallwaysBetween, addHallway, serializeHallways/deserializeHallways in hallways.ts"
    },
    {
      "id": "US-004",
      "title": "Implement hallway removal function",
      "description": "As a developer, I want a function to remove a hallway cleanly so that all associated state is updated.",
      "acceptanceCriteria": [
        "A function removeHallway(hallwayId: string) exists",
        "Removes the hallway from the game state hallways array",
        "Frees all tiles on the grid that the hallway occupied",
        "Removes any connections that depended on this hallway",
        "Upgrades on the hallway can be added and removed; upgrade data serializes correctly",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "removeHallway, removeHallwayFromGrid, addUpgradeToHallway, removeUpgradeFromHallway in hallways.ts with 17 tests"
    }
  ]
}
