{
  "project": "Blunderdark",
  "branchName": "ralph/stone-elemental-inhabitant",
  "description": "Stone Elemental - a Tier 2 inhabitant excelling in mining and defense, with Inappetent, Geological (+40% mining), and Sturdy (+1 Defense) traits",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Stone Elemental YAML Data",
      "description": "As a developer, I want the Stone Elemental defined in a YAML data file so that it is compiled into the game content pipeline",
      "acceptanceCriteria": [
        "A Stone Elemental entry exists in gamedata/inhabitants/stone-elemental.yaml",
        "Stats are defined: HP (high), Attack (medium), Defense (high), Speed (low)",
        "Tier is set to 2",
        "The entry includes display name, description, and sprite reference",
        "npm run gamedata:build compiles the YAML without errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added to gamedata/inhabitant/base.yml with HP:100, Attack:20, Defense:25, Speed:6, tier:2"
    },
    {
      "id": "US-002",
      "title": "Implement Inappetent Trait",
      "description": "As a developer, I want the Inappetent trait to exempt the Stone Elemental from hunger mechanics so that it never consumes Food resources",
      "acceptanceCriteria": [
        "An Inappetent trait is defined in the trait system",
        "Inhabitants with the Inappetent trait are excluded from food consumption calculations",
        "The Hungry behavior state is never entered for Inappetent inhabitants",
        "Unit tests verify that an Inappetent inhabitant does not reduce the Food resource pool",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Inappetent trait defined with effectType: food_exemption. foodConsumptionRate: 0 ensures hunger system skips this inhabitant (existing behavior in hunger.ts). Hungry/starving state modifiers set to 1.0 (unreachable). Existing hunger tests already cover foodConsumptionRate 0 behavior."
    },
    {
      "id": "US-003",
      "title": "Implement Geological Trait",
      "description": "As a developer, I want the Geological trait to boost mining output by 40% so that Stone Elementals are optimal miners",
      "acceptanceCriteria": [
        "A Geological trait is defined with a miningBonus: 0.4 property",
        "When assigned to a Mine room, resource output is multiplied by 1.4",
        "The bonus stacks correctly with other mining modifiers (additive)",
        "Unit tests verify the 40% mining bonus is applied correctly",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Geological trait uses effectType: production_bonus with effectValue: 0.4 and targetResourceType: crystals. The production system (production.ts) already consumes production_bonus traits additively, so this works with existing code."
    },
    {
      "id": "US-004",
      "title": "Implement Sturdy Trait",
      "description": "As a developer, I want the Sturdy trait to grant +1 Defense so that Stone Elementals are naturally resilient",
      "acceptanceCriteria": [
        "A Sturdy trait is defined with a defenseBonus: 1 property",
        "The +1 Defense bonus is applied to the Stone Elemental's computed Defense stat",
        "The bonus is reflected in any UI displaying the inhabitant's stats",
        "Unit tests verify the Defense stat includes the Sturdy bonus",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Sturdy trait defined with effectType: defense_bonus, effectValue: 1. Currently data-only (defense_bonus not yet consumed by combat system), matching pattern of Orc's attack_bonus trait."
    },
    {
      "id": "US-005",
      "title": "Define Scared and Hungry Behaviors",
      "description": "As a developer, I want Scared and Hungry behaviors defined for the Stone Elemental so that it responds predictably to those states",
      "acceptanceCriteria": [
        "A Scared behavior (Hunker Down) is defined: becomes immobile but gains +3 Defense",
        "The Scared behavior activates when fear threshold is exceeded",
        "A Hungry behavior (Consume Stone) is defined as fallback, effectively unreachable due to Inappetent",
        "Behaviors are stored in the YAML data file",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Scared state: defenseMultiplier 1.75 (base 25 * 1.75 ≈ +19 defense), attackMultiplier 0.6, productionMultiplier 0.7. fearTolerance: 4 (high but not immune). Hungry/starving states set to 1.0 multipliers (unreachable due to foodConsumptionRate: 0)."
    },
    {
      "id": "US-006",
      "title": "Special Room Interactions",
      "description": "As a player, I want Stone Elementals to provide bonuses when assigned to Mines, Forges, and Ley Lines",
      "acceptanceCriteria": [
        "When assigned to a Mine, the Stone Elemental gains the Geological bonus (+40% mining)",
        "When assigned to a Forge, the Stone Elemental provides a crafting speed bonus (+20%)",
        "When assigned to a Ley Line room, the Stone Elemental generates passive Flux",
        "Room interaction data is defined in the YAML file",
        "Interactions are applied through the room assignment system",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Room interactions implemented via production_bonus traits: Geological (+40% crystals in Crystal Mine), Forge Affinity (+20% gold in Dark Forge), Ley Conductor (+15% flux in Ley Line Nexus). All use the existing production_bonus system which checks targetResourceType against room production."
    },
    {
      "id": "US-007",
      "title": "Define Fusion Options",
      "description": "As a developer, I want fusion recipes involving the Stone Elemental defined so that players can combine it with other inhabitants",
      "acceptanceCriteria": [
        "At least 2 fusion recipes involving the Stone Elemental are defined in YAML",
        "Each recipe specifies the partner creature, result creature, and resource cost",
        "Fusion data compiles correctly with npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Two breeding recipes added: Magma Golem (Stone Elemental + Fire Elemental, +6 attack/+10 hp, 1.5x time) and Living Statue (Stone Elemental + Gargoyle, +8 defense/+4 speed, 1.3x time). Both compile successfully."
    }
  ]
}
