{
  "project": "Blunderdark",
  "branchName": "ralph/crystal-mine-room",
  "description": "Crystal Mine Room - A Tier 1 production room with an L-shaped footprint that generates 5 Crystals per minute, supports 2-4 inhabitants, has three upgrade paths, and adjacency bonuses with Mines, Forges, and Libraries.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Crystal Mine room in YAML gamedata",
      "description": "As a developer, I want the Crystal Mine defined in YAML gamedata so that it follows the content pipeline and is available at runtime.",
      "acceptanceCriteria": [
        "A crystal-mine.yaml file exists in the appropriate gamedata/ directory for rooms",
        "Fields include: id (UUID), name, description, shape (L-shaped tile offsets), baseProduction (5 Crystals/min), maxInhabitants (2), baseFearLevel (1), upgradePaths (3 paths)",
        "The L-shape is defined as a list of tile offsets relative to an anchor tile",
        "Adjacency bonuses for Mine+Mine, Mine+Forge, Mine+Library are defined in the YAML",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Crystal Mine updated in gamedata/room/base.yml with L-shape, 5 crystals/min (1.0/tick), maxInhabitants 2, fearLevel 1, adjacency bonuses for Mine+Mine/Forge/Library, and 3 upgrade paths. RoomUpgradePath type added to room.ts, ensureRoom updated."
    },
    {
      "id": "US-002",
      "title": "Define upgrade paths in gamedata",
      "description": "As a developer, I want three mutually exclusive upgrade paths defined for the Crystal Mine so that players can specialize their mine.",
      "acceptanceCriteria": [
        "Efficiency path: increases base production by +50% Crystals/min with a defined Crystal cost",
        "Capacity path: increases max inhabitants from 2 to 4 with a defined Crystal cost",
        "Specialization path: provides a unique bonus (e.g., reduced fear or secondary resource output) with a defined Crystal cost",
        "Choosing one path locks out the other two at the same tier",
        "Upgrade paths are included in the crystal-mine.yaml definition",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Three mutually exclusive upgrade paths defined in YAML: Deep Vein Extraction (productionMultiplier 1.5x, 75 crystals), Expanded Tunnels (maxInhabitantBonus +2, 60 crystals), Crystal Resonance (fearReduction 1 + secondaryProduction 0.2 flux, 80 crystals). PlacedRoom type extended with optional appliedUpgradePathId. room-upgrades.ts helper enforces mutual exclusivity: only one path per room, choosing one locks out all others. 22 tests covering validation, application, effects retrieval, and mutual exclusivity."
    },
    {
      "id": "US-003",
      "title": "Implement L-shaped room placement and rendering",
      "description": "As a dungeon builder, I want to place the Crystal Mine as an L-shaped room on the grid so that it occupies the correct tiles and renders properly.",
      "acceptanceCriteria": [
        "The Crystal Mine occupies an L-shaped set of tiles (3 tiles in a row + 1 tile extending from one end)",
        "The room can be rotated in 4 orientations during placement",
        "Placement validates that all L-shaped tiles are unoccupied before placing",
        "The room renders correctly on the grid in all 4 orientations",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Added Rotation type (0|1|2|3) to PlacedRoom. Implemented rotateTile90, rotateTiles, getRotatedShape pure functions in room-shapes.ts. Added placementRotation signal and rotatePlacement() to room-placement.ts. R key and right-click rotate during placement. Rotate button added to panel-room-select UI. resolveRoomShape now applies stored rotation so production/adjacency/connection systems automatically handle rotated rooms. 17 new tests for rotation math. Browser verified: all 4 orientations render correctly on grid."
    },
    {
      "id": "US-004",
      "title": "Implement base Crystal production logic",
      "description": "As a dungeon builder, I want the Crystal Mine to produce 5 Crystals per minute when staffed so that I have a reliable resource income.",
      "acceptanceCriteria": [
        "The Mine produces 5 Crystals per minute when at least 1 inhabitant is assigned",
        "Production is added to the Crystal resource pool via ResourceManager",
        "Production scales with the number of assigned inhabitants per the production formula",
        "Production rate is visible in the resource display UI",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Implement inhabitant capacity and upgrade",
      "description": "As a dungeon builder, I want the Crystal Mine to hold up to 2 inhabitants (4 when upgraded) so that I can staff it for production.",
      "acceptanceCriteria": [
        "Base capacity is 2 inhabitants",
        "Attempting to assign beyond capacity is rejected with user-facing feedback",
        "After the capacity upgrade path is chosen, the limit increases to 4",
        "Current/max inhabitant count is displayed on the room UI panel",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
