{
  "project": "Blunderdark",
  "branchName": "ralph/corruption-threshold-triggers",
  "description": "Corruption Threshold Triggers - A monitoring system that checks Corruption levels every game hour and triggers events when thresholds (50, 100, 200) are crossed, with pre-threshold warnings and support for Corruption reduction to avoid events.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create CorruptionThresholdService with periodic check",
      "description": "As a developer, I want a dedicated CorruptionThresholdService that checks Corruption levels every game hour so that threshold events are detected reliably and the logic is cleanly separated from the resource system.",
      "acceptanceCriteria": [
        "Create CorruptionThresholdService in src/app/services/ with providedIn: 'root'",
        "Service uses inject() to access TimeService and corruption signal",
        "Register a callback or effect on the hour signal to check Corruption each game hour",
        "Check runs only during normal gameplay (not during invasions)",
        "Service exposes a nextThreshold computed signal for UI consumption",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement threshold crossing detection",
      "description": "As a developer, I want to detect when Corruption crosses a threshold so that events trigger exactly once per crossing and re-trigger if Corruption drops below and crosses again.",
      "acceptanceCriteria": [
        "Track triggeredThresholds as a signal containing a set of numbers",
        "When Corruption >= threshold AND threshold not already triggered, fire the event",
        "If Corruption drops below a threshold, remove it from the triggered set to allow re-trigger on next crossing",
        "Thresholds defined as constants: 50, 100, 200",
        "Persist triggered thresholds to game state via IndexedDB",
        "Service delegates to effect systems (unlock, mutation, invasion) when thresholds are crossed",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add pre-threshold warning notifications",
      "description": "As a player, I want warnings before I reach major Corruption thresholds so that I can take action to reduce Corruption.",
      "acceptanceCriteria": [
        "Warn at 80% of each threshold: 40 for 50-threshold, 80 for 100-threshold, 160 for 200-threshold",
        "Warning message format: 'Corruption approaching [threshold]. [Effect description]. Current: [value]/[threshold]'",
        "Warning appears as a dismissible notification",
        "Warning only shows once per approach until threshold is crossed or Corruption drops below warning level",
        "Reducing Corruption below 80% of a threshold dismisses the warning",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Support Corruption reduction to avoid events",
      "description": "As a player, I want to reduce Corruption to avoid threshold events so that I have agency over the consequences of high Corruption.",
      "acceptanceCriteria": [
        "If Corruption drops below a threshold before the event fires, the event does not trigger",
        "Reducing Corruption below 80% of a threshold dismisses the associated warning",
        "Corruption reduction is visible in the resource change rate display",
        "Document available reduction methods (Dryad inhabitant, purification rooms) in code comments",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Write unit tests for threshold detection logic",
      "description": "As a developer, I want tests for threshold detection logic so that triggers are reliable and regressions are caught.",
      "acceptanceCriteria": [
        "Test: Crossing 50 triggers dark unlock event",
        "Test: Crossing 100 triggers mutation event",
        "Test: Crossing 200 triggers crusade event",
        "Test: Dropping below threshold and re-crossing triggers again",
        "Test: Already-triggered threshold does not re-fire without dropping below",
        "Tests located in src/app/helpers/corruption-thresholds.spec.ts",
        "All tests pass with npm run test",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
