{
  "project": "Blunderdark",
  "branchName": "ralph/fear-hunger-ui-indicators",
  "description": "Fear/Hunger UI Indicators - Visual feedback on the grid and in room panels showing fear level of rooms and hunger status of inhabitants with color-coded icons, tooltips, and low food warnings.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create FearIndicator and HungerIndicator component architecture",
      "description": "As a developer, I want fear and hunger indicators implemented as reusable standalone components with proper Angular conventions.",
      "acceptanceCriteria": [
        "FearIndicatorComponent accepts a room ID via input() signal and renders the fear icon",
        "HungerIndicatorComponent accepts an inhabitant ID via input() signal and renders the hunger icon",
        "Both components use ChangeDetectionStrategy.OnPush",
        "Both use input() signals and computed() for derived state",
        "Both support tooltip display via a shared tooltip mechanism",
        "Types use type keyword, not interface, per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Render fear icons on rooms in the grid",
      "description": "As a dungeon builder, I want to see a color-coded fear icon on each room on the grid so that I can assess fear levels at a glance.",
      "acceptanceCriteria": [
        "Each room on the grid displays a small fear icon (ghost, skull, or fear symbol)",
        "Icon color corresponds to fear level: None=hidden/gray, Low=green, Medium=yellow, High=orange, VeryHigh=red",
        "Rooms with fear level 0 (None) hide the icon entirely",
        "Icons are positioned consistently at top-right corner of the room's area",
        "Icons update reactively when fear level changes",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Render hunger icons on inhabitants in room panels",
      "description": "As a dungeon builder, I want to see hunger status icons on inhabitants in the room panel so that I know who needs feeding.",
      "acceptanceCriteria": [
        "Each inhabitant in a room's panel shows a hunger icon",
        "Fed = green icon or no icon; Hungry = yellow/orange icon; Starving = red icon",
        "Inappetent inhabitants show no icon or a special 'doesn't eat' indicator",
        "Icons are small and do not clutter the inhabitant list",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement fear and hunger tooltips",
      "description": "As a dungeon builder, I want tooltips on fear and hunger icons explaining their composition and effects.",
      "acceptanceCriteria": [
        "Hovering the fear icon shows tooltip with: base fear, inhabitant modifiers, propagated fear, and total (e.g., 'Base: Low (1) + Skeleton (+1) + Adjacent Soul Well (+1) = High (3)')",
        "Fear tooltip explains effects of the current level (e.g., 'High fear: -20% production for scared inhabitants')",
        "Hovering hunger icon shows: hunger state, food consumption rate, and effects (e.g., 'Hungry (-50% production). Consumes 2 Food/hr.')",
        "Inappetent inhabitants show tooltip: 'Does not eat.'",
        "Tooltips use the same tooltip infrastructure as other game tooltips for consistency",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Implement low food warning banner",
      "description": "As a dungeon builder, I want a prominent warning when food is running low so that I can act before inhabitants starve.",
      "acceptanceCriteria": [
        "A warning banner or icon appears in the resource bar when food drops below a defined threshold",
        "Warning is color-coded: yellow for low, red for critical/zero",
        "Warning includes estimated time until food runs out based on current consumption rate",
        "Warning is dismissible but reappears if the condition persists",
        "Component uses OnPush change detection",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
