{
  "project": "Blunderdark",
  "branchName": "ralph/day-night-production-modifiers",
  "description": "Day/Night Production Modifiers - Automatic production multipliers based on the current time of day phase: day boosts food and reduces undead efficiency, night boosts undead and corruption, twilight boosts flux generation.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define modifier types and registration mechanism",
      "description": "As a developer, I want a modifier registration mechanism with proper types so that time-based modifiers integrate cleanly with the resource production system.",
      "acceptanceCriteria": [
        "A ModifierSource type is defined in src/app/interfaces/ with fields: source (string tag), resourceType, multiplier, phase",
        "Time-based modifiers are tagged with source 'time-of-day' for identification",
        "Modifiers stack multiplicatively with other modifier sources (room adjacency, biome, etc.)",
        "Types use type keyword, not interface, per project conventions",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Types defined in day-night-modifiers.ts: DayNightResourceModifier, DayNightCreatureModifier, DayNightPhase. All tagged with source 'time-of-day'. Config arrays define modifiers."
    },
    {
      "id": "US-002",
      "title": "Implement day, night, and twilight phase modifiers",
      "description": "As a developer, I want production modifiers applied automatically based on the current time phase so that the day/night cycle affects resource strategy.",
      "acceptanceCriteria": [
        "During day phase (hours 7-17): Food production receives +25% modifier and undead inhabitant production receives -10% modifier",
        "During night phase (hours 19-5): Undead inhabitant production receives +30% modifier and corruption generation receives +50% modifier",
        "During dawn (hour 6) and dusk (hour 18): Flux generation receives +100% modifier",
        "Modifiers are computed signals derived from TimeService.currentPhase",
        "When phase changes, old modifiers are removed and new ones applied atomically",
        "Modifiers apply to all rooms/sources producing the affected resources",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Integrated into productionCalculateTotal, productionCalculateSingleRoom, and productionCalculateBreakdowns. Creature modifiers use weighted averaging based on undead/non-undead ratio. 48 tests passing."
    },
    {
      "id": "US-003",
      "title": "Display active time-based modifiers in the UI",
      "description": "As a player, I want to see which time-based modifiers are currently active so that I understand how the cycle affects my production.",
      "acceptanceCriteria": [
        "Active time modifiers are shown in a tooltip or panel near the resource display",
        "Each modifier displays the resource affected and the percentage change (e.g., 'Food +25%')",
        "Modifiers update in real time as phases change",
        "Component uses OnPush change detection and standalone component conventions",
        "Uses @if/@for native control flow, not *ngIf/*ngFor",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Added activeTimeModifiers computed signal to PanelResourcesComponent. Displays phase label and modifier badges below the resource bar using DaisyUI badge-success/badge-error styling. Uses @if/@for native control flow."
    }
  ]
}
