{
  "project": "Blunderdark",
  "branchName": "ralph/environmental-features",
  "description": "Environmental Features - Six room attachments (Coffins, Bioluminescent Moss, Arcane Crystals, Blood Altars, Geothermal Vents, Fungal Networks) that leverage the dungeon's natural environment to provide thematic bonuses and strategic depth.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define all environmental features in YAML gamedata",
      "description": "As a developer, I want all six environmental features defined in YAML so that the content pipeline handles them consistently.",
      "acceptanceCriteria": [
        "All six environmental features are defined in gamedata/feature/ YAML files",
        "Each definition includes: id (UUID), name, description, category ('environmental'), cost, bonuses, visual asset reference",
        "Coffins: +1 undead capacity, -1 Fear for undead",
        "Bioluminescent Moss: -1 Fear, +5% adjacent production",
        "Arcane Crystals: +1 Flux/min, +15% magic efficiency",
        "Blood Altar: sacrifice mechanic, +2 Corruption/min",
        "Geothermal Vents: +15% production, fire damage bonus",
        "Fungal Network: teleport connection between rooms",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "ContentService loads environmental features and makes them queryable by category",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement Coffins and Bioluminescent Moss bonus logic",
      "description": "As a player, I want Coffins and Bioluminescent Moss to apply their bonuses when attached to rooms.",
      "acceptanceCriteria": [
        "Coffins increases undead inhabitant capacity by 1 in the attached room",
        "Coffins applies -1 Fear modifier only to undead-type inhabitants in the room",
        "Bioluminescent Moss decreases room Fear value by 1",
        "Bioluminescent Moss grants +5% production modifier to adjacent connected rooms",
        "Adjacent bonus recalculates when rooms are added or removed nearby",
        "Bonuses are removed when the feature is detached",
        "Unit tests verify capacity increase, Fear reduction, and adjacency bonus calculation",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement Arcane Crystals and Geothermal Vents bonus logic",
      "description": "As a player, I want Arcane Crystals and Geothermal Vents to apply their production bonuses when attached.",
      "acceptanceCriteria": [
        "Arcane Crystals generates 1 additional Flux per minute in the attached room",
        "Arcane Crystals increases magic-related production by 15%",
        "Geothermal Vents increases room production by 15% across all resource types",
        "Geothermal Vents grants a fire damage bonus to inhabitants in combat",
        "Bonuses are removed when the feature is detached",
        "Unit tests verify Flux generation, magic efficiency, and production modifiers",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement Blood Altar sacrifice mechanic",
      "description": "As a player, I want the Blood Altar to allow sacrificing Food for temporary buffs while generating Corruption.",
      "acceptanceCriteria": [
        "Blood Altar generates +2 Corruption per minute passively when attached",
        "A 'Sacrifice' action on the room consumes a defined amount of Food",
        "Sacrifice grants a temporary buff (e.g., +production or +combat strength) defined in gamedata",
        "Sacrifice UI shows Food cost and buff description",
        "Corruption generation and sacrifice mechanic are removed when the feature is detached",
        "Unit tests verify Corruption generation and sacrifice consumption",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Implement Fungal Network teleportation system",
      "description": "As a player, I want Fungal Networks to enable instant inhabitant transfer between linked rooms.",
      "acceptanceCriteria": [
        "Two rooms with Fungal Networks attached become linked for instant inhabitant transfer",
        "A UI action allows selecting a destination Fungal Network room for transfer",
        "Transfer is instant with no travel time through hallways",
        "If a Fungal Network is removed, the link to that room is broken",
        "Fungal Network links use a many-to-many relationship data structure",
        "Unit tests verify link creation, transfer, and destruction",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    }
  ]
}
