{
  "project": "Blunderdark",
  "branchName": "ralph/alchemy-lab-room",
  "description": "Alchemy Lab Room - Tier 2 conversion room that transforms Crystals and Food into Flux with L-shaped layout and upgrade paths.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define Alchemy Lab YAML gamedata",
      "description": "As a developer, I want the Alchemy Lab defined in YAML gamedata so that it is available through the content pipeline.",
      "acceptanceCriteria": [
        "An alchemy-lab.yaml file exists in the appropriate gamedata/ directory",
        "Fields include: id, name, description, shape (L-shaped), conversionRecipes, maxInhabitants, baseFearLevel, upgradePaths",
        "Shape is L-shaped defined as a list of tile offsets",
        "Base fear level set to Medium (2)",
        "The YAML compiles to valid JSON via npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Alchemy Lab defined in gamedata/room/base.yml with L-shaped layout (shapeId 1c224b76), role alchemyLab, fearLevel 2, maxInhabitants 1, 3 upgrade paths. Recipes in gamedata/alchemyrecipe/base.yml."
    },
    {
      "id": "US-002",
      "title": "Implement L-shaped room placement with rotation",
      "description": "As a dungeon builder, I want to place the Alchemy Lab as an L-shaped room on the grid with rotation support.",
      "acceptanceCriteria": [
        "The Alchemy Lab occupies an L-shaped set of tiles",
        "The room can be rotated (4 orientations) during placement",
        "Placement validates that all L-shaped tiles are unoccupied",
        "The room renders correctly on the grid in all orientations",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Uses existing Small L-Shape (shapeId 1c224b76) which supports 4 rotations via the room shape system."
    },
    {
      "id": "US-003",
      "title": "Implement base Flux conversion logic",
      "description": "As a dungeon builder, I want the Alchemy Lab to convert 5 Crystals + 5 Food into 1 Flux.",
      "acceptanceCriteria": [
        "The Lab converts 5 Crystals + 5 Food into 1 Flux per conversion cycle",
        "Conversion requires at least 1 inhabitant assigned",
        "Conversion only proceeds if sufficient Crystals and Food are available",
        "Resources are deducted and Flux is added atomically (no partial conversion)",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Implemented in alchemy-lab.ts. Input consumed at cycle start (inputConsumed flag), output produced at cycle end. Unit tested."
    },
    {
      "id": "US-004",
      "title": "Implement conversion cycle timing and progress",
      "description": "As a dungeon builder, I want conversion to happen on a defined time cycle so that production is predictable.",
      "acceptanceCriteria": [
        "Each conversion cycle has a defined duration",
        "Conversion automatically repeats if resources are available",
        "Cycle pauses if the inhabitant is removed or resources are depleted",
        "Conversion state (cycle progress, active recipe) stored on room instance in game state",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "AlchemyConversion type in state-game.ts tracks roomId, recipeId, progress, targetTicks, inputConsumed. Continuous conversion auto-repeats. Base ticks from recipe baseTicks field."
    },
    {
      "id": "US-005",
      "title": "Implement inhabitant capacity and display",
      "description": "As a dungeon builder, I want the Alchemy Lab to hold 1 inhabitant (3 when upgraded).",
      "acceptanceCriteria": [
        "Base capacity is 1 inhabitant",
        "Attempting to assign a 2nd inhabitant is rejected with feedback",
        "Current/max inhabitant count is displayed on the room UI",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Base maxInhabitants: 1. Expanded Capacity upgrade adds maxInhabitantBonus: 2 (total 3). Panel shows assigned worker count."
    },
    {
      "id": "US-006",
      "title": "Implement conversion rate UI display",
      "description": "As a dungeon builder, I want to see the conversion rate and progress in the room's UI panel.",
      "acceptanceCriteria": [
        "A progress indicator shows the current cycle's completion percentage",
        "Conversion rate is visible in the room's UI panel",
        "Input/output resources are displayed clearly",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Panel-alchemy-lab component shows progress bar, input/output resources, recipe selection buttons, and active conversion status."
    },
    {
      "id": "US-007",
      "title": "Define upgrade paths in YAML",
      "description": "As a developer, I want three mutually exclusive upgrade paths defined in gamedata for the Alchemy Lab.",
      "acceptanceCriteria": [
        "Efficient Distillation upgrade: reduces cost to 3 Crystals + 3 Food = 1 Flux",
        "Advanced Alchemy upgrade: unlocks new recipes (Gold + Crystals = Essence, Food + Corruption = Dark Flux)",
        "Expanded Capacity upgrade: increases max inhabitants from 1 to 3",
        "Each upgrade has a defined resource cost",
        "Choosing one path locks out alternatives at this tier",
        "Upgrade data compiles correctly with npm run gamedata:build",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "3 upgrades in same tier (mutual exclusion): Efficient Distillation (alchemyCostMultiplier: 0.6), Advanced Alchemy (alchemyTierUnlock: 1), Expanded Capacity (maxInhabitantBonus: 2). All compile correctly."
    },
    {
      "id": "US-008",
      "title": "Implement multiple inhabitant scaling",
      "description": "As a dungeon builder, I want additional inhabitants to speed up conversion so that staffing the Lab is worthwhile.",
      "acceptanceCriteria": [
        "Each additional inhabitant reduces cycle time by a percentage (e.g., -25% per extra inhabitant)",
        "Maximum benefit is capped (no zero-time conversion)",
        "Scaling formula is defined in gamedata",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Worker scaling: 25% reduction per extra worker beyond first, capped at 0.5 multiplier. Implemented in alchemyLabGetConversionTicks(). Unit tested."
    }
  ]
}
