{
  "project": "Blunderdark",
  "branchName": "ralph/collapsible-side-panels",
  "description": "Collapsible Side Panel System - Replace the fixed sidebar with a vertical tab rail on the left edge that expands floating panels over the game map",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create SideTabRailComponent with overlay container",
      "description": "As a developer, I need a new component that renders a vertical rail of tab labels on the left edge and an expandable overlay panel container, so all game panels can be accessed from a fixed position.",
      "acceptanceCriteria": [
        "New SideTabRailComponent created in src/app/components/side-tab-rail/",
        "Component accepts a tab definitions input: array of objects with id, label, condition (optional Signal<boolean>), isModal (boolean), and a template ref or content projection slot",
        "Renders a vertical column of tab buttons fixed to the left edge, full height, narrow width (~40-48px)",
        "Clicking a non-modal tab opens a floating overlay panel to the right of the rail showing the associated content",
        "Clicking a modal tab emits an output event with the tab id instead of opening the overlay",
        "Only one panel can be expanded at a time — opening a new tab closes the previous one",
        "Clicking the same tab again collapses it (toggle behavior)",
        "An activePanel signal (input/model) tracks which panel is open or null",
        "Conditional tabs (where condition signal is false) are hidden from the rail",
        "If the active panel's condition becomes false, the panel auto-closes",
        "Overlay panel has constrained max-width (w-64), vertical scroll on overflow, visible background/shadow/border",
        "Rail z-index is above PIXI canvas but below modals",
        "Active tab has a visually distinct highlighted state",
        "Uses daisyUI/Tailwind styling consistent with the rest of the app",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Component created with SideTabDefinition type, model-based activePanel, modalTabClick output, auto-close effect, vertical writing-mode labels, fixed positioning with z-index 30."
    },
    {
      "id": "US-002",
      "title": "Integrate side tab rail into game-play layout",
      "description": "As a developer, I need to add the SideTabRailComponent to the game-play page alongside the existing sidebar, wiring up the activePanel signal and modal output handlers, so the new rail is visible and functional.",
      "acceptanceCriteria": [
        "SideTabRailComponent is imported and added to the game-play.component.html template",
        "Rail is positioned to the left of the existing layout (both old sidebar and new rail coexist temporarily)",
        "An activePanel signal is created in GamePlayComponent",
        "Modal tab click events are wired to existing showResearch, showFusion, and showVictoryMenu signals",
        "Tab definitions array is set up with all panel entries (initially empty content — panels will be migrated in subsequent stories)",
        "The rail renders and tabs are clickable, even if panel content is not yet migrated",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "21 tab definitions created using shared placeholder template. Modal handlers wired for research/fusion/victory. viewChild for placeholderPanel template ref."
    },
    {
      "id": "US-003",
      "title": "Migrate Resources and Morale bar to collapsible tab",
      "description": "As a player, I want the resource bar and morale bar accessible from a 'Resources' side tab so I can maximize map visibility.",
      "acceptanceCriteria": [
        "A 'Resources' tab appears in the side rail",
        "Clicking it expands a panel showing app-panel-resources and app-morale-bar",
        "The resource-bar-container div is removed from the top of the game-play template",
        "The game container height is updated (no longer needs calc offset for the resource bar at top)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Resources and morale bar moved to dedicated ng-template, resource-bar-container removed."
    },
    {
      "id": "US-004",
      "title": "Migrate Floor Selector to collapsible tab",
      "description": "As a player, I want the floor selector accessible from a 'Floors' side tab so I can switch floors without a persistent UI element.",
      "acceptanceCriteria": [
        "A 'Floors' tab appears in the side rail",
        "Clicking it expands the floor selector panel (app-panel-floor-selector)",
        "app-panel-floor-selector is removed from the old sidebar div",
        "PageUp/PageDown keyboard shortcuts for floor navigation still work regardless of panel state",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Floor selector moved to dedicated ng-template, removed from sidebar. PageUp/PageDown shortcuts in host bindings work independently."
    },
    {
      "id": "US-005",
      "title": "Migrate always-visible panels to collapsible tabs",
      "description": "As a player, I want Time, Build, Roster, and Reputation panels accessible as side tabs so I can open them with one click instead of scrolling.",
      "acceptanceCriteria": [
        "A 'Time' tab appears in the rail, expanding to show app-panel-time-of-day",
        "A 'Build' tab appears in the rail, expanding to show app-panel-room-select",
        "A 'Roster' tab appears in the rail, expanding to show app-panel-roster",
        "A 'Reputation' tab appears in the rail, expanding to show app-panel-reputation",
        "All four panels are removed from the old sidebar div",
        "Each tab expands to show its full panel content in the overlay",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Time, Build (room-select), Roster, and Reputation panels migrated to dedicated ng-templates and removed from old sidebar."
    },
    {
      "id": "US-006",
      "title": "Wire modal-only tabs for Research, Fusion, and Victory",
      "description": "As a player, I want Research, Fusion, and Victory tabs to immediately open their modal when clicked for fastest access.",
      "acceptanceCriteria": [
        "A 'Research' tab appears in the side rail (always visible)",
        "Clicking 'Research' directly sets showResearch signal to true — no intermediate panel expands",
        "A 'Fusion' tab appears in the side rail only when canShowFusion() is true",
        "Clicking 'Fusion' directly sets showFusion signal to true — no intermediate panel expands",
        "A 'Victory' tab appears in the side rail (always visible)",
        "Clicking 'Victory' directly sets showVictoryMenu signal to true — no intermediate panel expands",
        "The inline Fusion Chamber card and Victory Paths card are removed from the old sidebar",
        "The research-summary panel is removed from the old sidebar (modal-only access now)",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Fusion Chamber card, Victory Paths card, and research-summary panel removed from sidebar. Modal tab handlers already wired in US-002."
    },
    {
      "id": "US-007",
      "title": "Migrate conditional room panels batch 1 to tabs",
      "description": "As a player, I want Training Grounds, Breeding Pits, Summoning Circle, Dark Forge, and Alchemy Lab panels to appear as tabs only when their room exists.",
      "acceptanceCriteria": [
        "A 'Training' tab appears in the rail only when a training grounds room exists",
        "A 'Breeding' tab appears in the rail only when a breeding pits room exists",
        "A 'Summoning' tab appears in the rail only when a summoning circle room exists",
        "A 'Forge' tab appears in the rail only when a dark forge room exists",
        "A 'Alchemy' tab appears in the rail only when an alchemy lab room exists",
        "Clicking each tab expands its respective panel component in the overlay",
        "All five panels are removed from the old sidebar div",
        "If the currently-open panel's room is destroyed, the panel auto-closes",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Training, Breeding, Summoning, Dark Forge, Alchemy panels migrated with hasRoomOfRole conditions. Auto-close on condition change handled by SideTabRailComponent effect."
    },
    {
      "id": "US-008",
      "title": "Migrate conditional room panels batch 2 to tabs",
      "description": "As a player, I want Torture Chamber, Altar, Throne Room, and Merchant panels to appear as tabs only when their room/condition exists.",
      "acceptanceCriteria": [
        "A 'Torture' tab appears in the rail only when a torture chamber room exists",
        "An 'Altar' tab appears in the rail only when an altar room exists",
        "A 'Throne' tab appears in the rail only when a throne room exists",
        "A 'Merchant' tab appears in the rail only when the merchant is present",
        "Clicking each tab expands its respective panel component in the overlay",
        "All four panels are removed from the old sidebar div",
        "If the currently-open panel's condition becomes false, the panel auto-closes",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Torture, Altar, Throne, Merchant panels migrated with conditions. merchantIsPresent signal used for Merchant tab."
    },
    {
      "id": "US-009",
      "title": "Migrate contextual panels with auto-open on tile selection",
      "description": "As a player, when I click a tile on the map, the relevant info panel (Room Info, Hallway Info, Synergy) should automatically open as a side panel tab.",
      "acceptanceCriteria": [
        "A 'Room' tab appears in the rail only when a room is selected (selectedRoom signal is truthy)",
        "A 'Hallway' tab appears in the rail only when hallway info data exists",
        "A 'Synergy' tab appears in the rail only when synergy data exists",
        "When a tile is selected on the PIXI canvas, the appropriate panel auto-opens by setting the activePanel signal",
        "If a different panel was already open, it gets replaced by the contextual panel",
        "Clicking the contextual tab again or deselecting the tile closes the panel",
        "All three panels are removed from the old sidebar div",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Room Info, Hallway Info, Synergy migrated to tabs. Auto-open effect sets activePanel to room-info or hallway-info on tile selection. Synergy tab uses hasSelectedRoom condition."
    },
    {
      "id": "US-010",
      "title": "Remove old sidebar and make canvas full-width",
      "description": "As a developer, I need to remove the now-empty old sidebar div and restructure the game-play layout so the PIXI canvas fills the full viewport behind the tab rail.",
      "acceptanceCriteria": [
        "The <div class='sidebar'> element is completely removed from game-play.component.html",
        "The resource-bar-container div is removed if not already gone",
        "app-grid fills the entire game container area (full width, no sidebar offset)",
        "The side tab rail and expanded panel overlay float above the grid via z-index",
        "All existing modal overlays (Research, Fusion, Victory) continue to work",
        "Autosave notification remains fixed bottom-right",
        "No orphaned imports or unused component references remain in game-play.component.ts",
        "Typecheck passes",
        "Lint passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Sidebar div removed, grid fills full container, RouterModule removed, .should-layer CSS removed, overflow hidden added to game-container."
    },
    {
      "id": "US-011",
      "title": "Persist active panel selection to localStorage",
      "description": "As a player, I want my last-opened panel remembered so it reopens when I return to the game.",
      "acceptanceCriteria": [
        "The activePanel signal in GamePlayComponent is backed by localStorageSignal from @helpers/signal.ts",
        "On page load, the previously active panel reopens automatically",
        "If the persisted panel's visibility condition is false on load, fall back to no panel open (null)",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": "activePanel uses signalLocalStorage for persistence. SideTabRailComponent auto-close effect handles fallback when persisted panel's condition is false."
    }
  ]
}
