{
  "project": "Blunderdark",
  "branchName": "ralph/save-file-versioning",
  "description": "Save file versioning system with version stamping, migration pipeline, and graceful handling of incompatible or newer-version saves",
  "userStories": [
    {
      "id": "US-001",
      "title": "Save Version Stamping",
      "description": "As a developer, I want every save file to include the current game save version so that the version is always known on load",
      "acceptanceCriteria": [
        "A SAVE_VERSION constant is defined and incremented with each save format change",
        "The serialization function includes saveVersion: SAVE_VERSION in the save data",
        "The save version is separate from the game application version",
        "Unit tests verify that serialized saves include the correct version",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "SAVE_VERSION constant in save-migrations.ts, SAVE_FORMAT_VERSION re-exported from save.ts for backward compat"
    },
    {
      "id": "US-002",
      "title": "Version Detection on Load",
      "description": "As a developer, I want the load process to detect the save file version so that appropriate migration or warnings can be applied",
      "acceptanceCriteria": [
        "On load, the save version is read before full deserialization",
        "If the save version matches current, proceed normally",
        "If the save version is older, trigger migration pipeline",
        "If the save version is newer, show a warning to the player",
        "If the save has no version field, treat as version 1 (legacy)",
        "Unit tests verify version detection for all cases",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "saveMigrationDetectVersion() reads formatVersion, defaults to 1 for missing/invalid. saveDeserialize() returns SaveMigrationResult."
    },
    {
      "id": "US-003",
      "title": "Migration Pipeline",
      "description": "As a developer, I want a migration pipeline that sequentially upgrades save data from any older version to the current version",
      "acceptanceCriteria": [
        "A migrations array/map contains migration functions keyed by source version",
        "Each migration function transforms save data from version N to version N+1",
        "Migrations chain sequentially (v1 -> v2 -> v3 -> current)",
        "Each migration function is pure (input save data, output transformed save data)",
        "Migration functions are individually unit tested",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "saveMigrations Map in save-migrations.ts, saveMigrationRun() chains sequentially with deep clone"
    },
    {
      "id": "US-004",
      "title": "Adding New Fields Migration",
      "description": "As a developer, I want migrations to handle new fields added in newer versions so that old saves gain default values",
      "acceptanceCriteria": [
        "When a new field is added to the save schema, a migration is created",
        "The migration sets a sensible default value for the new field",
        "Existing data in the save is preserved unchanged",
        "Unit tests verify the migration adds the field with the correct default",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Test demonstrates adding default fields. Deep clone ensures original data is preserved."
    },
    {
      "id": "US-005",
      "title": "Removing/Renaming Fields Migration",
      "description": "As a developer, I want migrations to handle removed or renamed fields so that old saves are cleaned up correctly",
      "acceptanceCriteria": [
        "When a field is removed, the migration deletes it from save data",
        "When a field is renamed, the migration copies the value to the new key and deletes the old",
        "Data integrity is maintained through the transformation",
        "Unit tests verify field removal and rename migrations",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Tests demonstrate remove and rename patterns including array integrity."
    },
    {
      "id": "US-006",
      "title": "Newer Version Warning",
      "description": "As a player, I want a warning when loading a save from a newer game version so that I understand potential issues",
      "acceptanceCriteria": [
        "If save version > current version, a dialog warns about the newer version",
        "The dialog offers Try to Load Anyway and Cancel options",
        "If the player proceeds, the system attempts to load without migration",
        "If loading fails, a clear error message is shown",
        "Verify in browser using dev-browser skill",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Both panel-save-slots and button-savefile-import show SweetAlert2 confirm dialog with Try to Load Anyway / Cancel. saveDeserializeForceLoad() used for force loading."
    },
    {
      "id": "US-007",
      "title": "Incompatible Save Handling",
      "description": "As a player, I want graceful handling when a save file is completely incompatible so that the game does not crash",
      "acceptanceCriteria": [
        "If migration throws an error, the error is caught and logged",
        "The player sees a message about the save being incompatible or corrupted",
        "The game returns to the main menu / save slot selection",
        "The incompatible save is not deleted",
        "Unit tests verify error handling in migration pipeline",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Migration errors are caught and returned in SaveMigrationResult. Components show error notification. Save data is never deleted on failure."
    }
  ]
}
